-- MySQL dump 10.13  Distrib 8.0.24, for Linux (x86_64)
--
-- Host: 127.0.0.1    Database: countryside
-- ------------------------------------------------------
-- Server version	8.0.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `countryside`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `countryside` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `countryside`;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '姓名',
  `nick_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '昵称',
  `phone` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '手机号',
  `password` varchar(64) NOT NULL COMMENT '密码',
  `avatar_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '头像的url地址',
  `village` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '乡村地址',
  `address_default_id` bigint DEFAULT NULL COMMENT '用户默认地址id',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1741884855298228226 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='管理员信息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` VALUES (1,'管理员','管理员','13642001230','e10adc3949ba59abbe56e057f20f883e','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s3r5zy.jpg','英德市 连江口镇 连樟村',NULL,'2023-12-27 18:47:15'),(1741679222822281217,'张三','tes1111t','18318085358','e10adc3949ba59abbe56e057f20f883e','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s2nhwf.jpg','英德市 连江口镇 连樟村',NULL,'2024-01-01 12:34:20'),(1741884855298228225,'苏泽伦','团团儿','17353037925','21420aca55cefa0dfd891c61765b3e08','https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/85318615Zli1lg9MEpebeGGMWGD2KKM8.jpg','清远市清城区',NULL,'2024-01-02 02:11:27');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `article` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '文章id\r\n',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章标题',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章内容',
  `article_type` int NOT NULL COMMENT '文章分类1、乡村振兴2、特产介绍3、农业技术4、问题答疑',
  `author` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '作者用户名',
  `author_id` bigint NOT NULL COMMENT '作者的用户id',
  `date_created` datetime NOT NULL COMMENT '文章创建时间',
  `date_updated` datetime NOT NULL COMMENT '文章更新时间',
  `read_number` int NOT NULL DEFAULT '0' COMMENT '阅读量',
  `comment_number` int NOT NULL DEFAULT '0' COMMENT '评论数量',
  `thumbnail_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '文章略缩图链接',
  `synopsis` varchar(50) DEFAULT NULL COMMENT '文章简介',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `author_id` (`author_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1757295365400326147 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='文章表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (1740249922797584387,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',1,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',61,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1740249922797584393,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',1,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',11,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1740249922797584394,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',1,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',24,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1740249922797584395,'湟中蚕豆','想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。',2,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',22,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg','湟中蚕豆,青海省西宁市湟中县\n特产,全国农产品地理标志。'),(1740249922797584396,'湟中蚕豆','想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。',2,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',15,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg','湟中蚕豆,青海省西宁市湟中县\n特产,全国农产品地理标志。'),(1740249922797584397,'湟中蚕豆','想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。',2,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',11,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg','湟中蚕豆,青海省西宁市湟中县\n特产,全国农产品地理标志。'),(1740249922797584398,'湟中蚕豆','想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。',2,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',8,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg','湟中蚕豆,青海省西宁市湟中县\n特产,全国农产品地理标志。'),(1740340760856858627,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',3,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',16,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1740340760856858628,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',3,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',9,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1740340760856858629,'黄瓜种植过程中对温度、光照、水分、土壤的要求','<p>想要种好黄瓜，科学的管理方法对于黄瓜增产很关键，下面本文主要通过温度、光照、水分、土壤等四个方面进行讲解，希望能给农户们提供一些参考。</p><p><img width=\"320px\" src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg\"></img></p><p style=\"font-weight:bold;\">一、种植温度条件</p><p>对于黄瓜的种植温度生长很重要，很多地区基本上在春季农历三月三开始种植，也就是温度适宜的气候下即可种植，大概黄瓜温度在25度左右，夜间温度在16度左右最佳，基本上地温在22度左右即可进行播种，温度过低的情况会出现黄瓜苗冻伤影响黄瓜产量。</p><p style=\"font-weight:bold;\">二、光照强度</p><p>黄瓜在我国多个地区都可以种植，但是适宜的光照利于植物生长，基本上黄瓜种植的每天日照时间要在9个小时左右，更利于黄瓜的生长发育、品质以及产量。</p><p style=\"font-weight:bold;\">三、土壤的选择</p><p>黄瓜的种植选择较为适宜的土壤很重要，要符合黄瓜生长习性才是更好的，基本上选择较为肥沃、疏松、排水性强、透气的微碱性土壤最佳，选择土壤较为肥沃的，可以适当的减少施肥，因为黄瓜种植较为的不耐肥。</p><p style=\"font-weight:bold;\">四、浇水和湿度作业</p><p>对于保持黄瓜的水分和湿度很重要，建议大家进行适当的浇水即可，不耐涝，基本上可以根据黄瓜的长势情况而定，然后黄瓜的土壤湿度在70%左右即可，很多地区都出现过因为空气湿度大导致病害减产的现象，进行正确的浇水和湿度的管理很关键。</p>',3,'宋子韬',1,'2023-11-23 12:26:00','2023-11-23 12:26:00',17,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/v2_s2q1rn.jpg',NULL),(1742104116629274625,'21313','<p>123123123123213123</p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/66382075WsJ9T1VVEYOT73U3pKly2mB1.png\" width=\"132\" style=\"\"></p>',4,'666',1742101348787093505,'2024-01-02 16:42:43','2024-01-02 16:42:43',67,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/66382075WsJ9T1VVEYOT73U3pKly2mB1.png','123123123123213123'),(1754460311159463938,'😊😂','<p><br></p><p>😊😂</p>',4,'张三',1742169110809092099,'2024-02-05 19:01:49','2024-02-05 19:01:49',93,0,NULL,'😊😂'),(1755309682138718210,'大豆技术','<p>一、土壤准备</p><p><br></p><p><br></p><p><br></p><p>1、播前整地：播前整地包括播前进行的土壤耕作及耙、耪、压等。由于采用了不同的整地技术，因此，播前整地工作也有所不同。如平翻、垄作、耙茬、深松等。</p><p><br></p><p>2、播前灌溉：对于墒情不好的地块，有灌溉条件的，可在播前1-2天灌水1次，浸湿土壤即可，以利播后种子发芽。</p><p><br></p><p>3、播前封闭除草：我国东北大豆主产区一些大型农场，大豆栽培面积大，如管理不及时，则杂草为害严重，常在播前采用机械喷施除草剂，进行大田封闭除草。氟乐灵等除草剂可在播前进行土壤喷雾。用氟乐灵可有效防除1年生禾本科杂草和某些1年生阔叶草。</p><p><br></p><p>二、精选种子</p><p><br></p><p><br></p><p><br></p><p>具有良好播种品质的种子，发芽率和发芽势高，苗整齐茁壮。所以在播种前应将病粒、虫蛀粒、小粒、秕粒和破瓣粒拣出。同时还要根据本品种固有的典型特征，如粒型、粒色、种子大小、种脐大小和颜色深浅，剔除混杂的异品种种子，以提高种子纯度。采用人工粒选的效果很好，如果用种量大，可采用螺旋式大豆粒选机，其机械结构简单，便于移动，适合大豆种植专业户应用。精选净度要求达97%以上，纯度98%以上。</p><p><br></p><p><br></p><p>三、种子测定和发芽试验</p><p><br></p><p>经过精选的种子在播种前应测定粒重和做发芽率试验。这两项工作是计算播种量的根据。将经过精选的种子，随机取样3份，每份随机抽出100粒种子，各自称重并求出平均数，即为该品种的百粒重。其单位用克表示。种子发芽率测定：将上述3份各100粒种子，分别放人3个小蝶或发芽皿中，下垫草纸或河沙。加水至薄水层，然后将种子均匀摆好，放在20℃左右温暖处(灶旁或保温箱内)吸水膨胀发芽。经过5-7天计算能正常长根发芽的种子数，并将3个样本加以平均，即为该种子的发芽率。要求发芽率95%以上。</p><p><br></p><p>四、种子处理</p><p><br></p><p>为防治蛴螬、地老虎、根蛆、根腐病等苗期病虫害，常用种子量0.3%-0.4%多菌灵加福美双(1:1)，或用0.3%-0.5%多菌灵加克菌丹(1:1)拌种。要注意采用根瘤菌拌种后，不能再拌杀虫剂和杀菌剂。</p><p><br></p><p>五、播种量的确定</p><p><br></p><p><br></p><p>第一步，将已测定的某品种百粒重换算成每千克粒数。如某品种测得百粒重为20克，则每千克粒数为：100粒*1000克÷20克＝5000粒。</p><p><br></p><p>第二步，计算每667平方米播种粒数。根据实际情况计算出每667平方米保苗株数，然后按照当地耕作条件和管理水平，加上一定数量的损失率(如机械、人、畜在田间管理过程中和人工间苗所造成的损失)，一般田间损失率可按15％-20％计算。单位面积上计划保苗数加田间损失率，即为每667平方米(1亩)播种粒数。如某品种计划每667平方米保苗2.5万株，田间损失率估计为20％，则每667平方米播种粒数为：每667平方米播种粒数：25000十25000*20％＝30000粒</p><p>第三步，计算每667平方米播种量。其公式如下：每667平方米播种量（千克）=每667平方米播种粒数/（每千克种子粒数*发芽率）。例如，计划每667平方米播种30000粒，已测得每千克种子粒数为5000粒，已测得发芽率为95％。代人公式：每667平方米播种量：30000/（50000*0.95)=6.3(千克)。</p><p><br></p><p>六、合理密植</p><p><br></p><p>种植密度与产量有密切关系。所谓合理密植是指在当地、当时的具体条件下，正确处理好个体和群体的关系，使群体得到最大限度的发展，个体也得到充分发育；使单位面积上的光能和地力得到充分利用；在同样的栽培条件下，能获得最好的经济效益。因此，一个适宜的密度不是一成不变的，不能简单地讲“肥地宜稀，瘦地宜密”，主要应考虑以下因素：</p><p><br></p><p>1.品种：品种的繁茂程度，如植株高度、分枝多少、叶片大小等与密度的关系密切。凡植株高大，分枝较多，株型开展，大叶型品种，种植密度宜小；植株矮小，繁茂性差的品种，或植株虽较高，但分枝少，株型收敛的品种，宜采用较大的密度。</p><p><br></p><p>2.肥水条件：同一品种在肥水条件较好时，植株生长繁茂，密度宜小；反之，肥水条件差，密度应较大。试验表明：土壤肥力和施肥水平与种植密度有密切关系。</p><p><br></p><p>3.品种类型和种植季节：一般春大豆生育期较长，植株高大，种植密度宜稀；夏大豆生育期较短，秋大豆生育期最短，植株也较矮小，宜适当密植。</p><p><br></p><p>以上是确定播种密度的一般原则。由于各地的气候、土壤条件不同，栽培制度各异，管理水平和种植的品种不一，不可能统一种植同一个密度。一般可参考下列种植密度：</p><p><br></p><p>（1）北方春大豆的播种密度</p><p><br></p><p>在肥沃土地，种植分枝性强的品种，亩保苗0.8-1万株为宜。在瘤薄土地，种植分枝性弱的品种，亩保苗1.6-2万株为宜。高纬度高寒地区，种植的早熟品种，亩保苗2-3万株。在种植大豆的极北限地区，极早熟品种，亩保苗3-4万株。</p><p><br></p><p>（2）黄淮平原和长江流域夏大豆的播种密度</p><p><br></p><p>一般每亩1.5-3万株。平坦肥沃，有灌溉条件的土地，亩保苗1.2-1.8万株。肥力中等及肥力一般的地块，亩保苗2.2-3万株为宜。</p><p><br></p><p>七、播种期</p><p><br></p><p><br></p><p>播种期早晚对产量和品质的影响非常大。播种过早、过晚，对大豆生长发育均不利。适时播种，保苗率高，出苗整齐、健壮，生育良好，茎秆粗壮。播种过晚，出苗虽快，但苗不健壮，如遇墒情不好，还会出苗不齐。北方区，晚熟品种易遭早霜危害，有贪青晚熟减产的危险。播种过早，在东北地区，由于土壤温度低，发芽迟缓，易发生烂种现象。</p><p><br></p><p><br></p><p>地温与土壤水分是决定春播大豆适宜播种期的两个主要因素。一般认为，北方春播大豆区，土壤5-10厘米深的土层内，日平均地温8-10℃时，土壤含水量为20%左右，播种较为适宜。所以，东北地区大豆适宜播种期在4月下旬至5月中旬，其北部5月上中播种，中部4月下旬至5月中旬播种，南部4月下旬至5月中旬播种；北部高原地区4月下旬至5月中旬播种，其东部5月上中旬播种，西部4月下旬至5月中旬播种；西北地区4月中旬至5月中旬播种，其北部4月中旬至5月上旬播种，南部4月下旬至5月中旬播种。</p><p><br></p><p><br></p><p><br></p><p>黄淮海区和南方区大豆种植区，大豆的播期受后茬和后期低温的制约。黄淮海区夏播大豆6月中下旬播种。南方区，长江亚区夏播大豆5月下旬至6月上旬播种，春播大豆4月上旬至5月上旬播种;东南亚区，春大豆3月下旬至4月上旬播种，夏大豆5月下旬至6月上旬播种，秋大豆7月下旬至8月上旬播种；中南亚区，春大豆3月下旬至4月上旬播种，夏大豆6月上中旬播种，秋大豆7月中旬至8月上旬播种；西南亚区，春大豆4月份播种，夏大豆5月上中旬播种;华南亚区，春大豆2月下旬至3月上旬播种，夏大豆5月下旬至6月上旬播种，秋大豆7月份播种，冬大豆12月下旬至翌年1月上旬播种。</p><p><br></p><p>夏播和秋播大豆由于生长季节较短，适期早播很重要。另外，播种期也可根据品种生育期类型、地块的地势等加以适当调整。晚熟品种可早播，中、早熟品种可适当后播。春早，地温、地势高的，可早些播种，土壤墒情好的地块可晚些播，岗平地可以早些播种。</p><p><br></p><p><br></p><p><br></p><p>为什么要强调适时早播呢？首先，春大豆适时早播，有利于第二造、第三造作物按时抢上季节，不违农时。第二，春大豆适当早播，可以相对早收，能避开第二代豆荚螟为害高峰期。第三，春大豆早播可以相对早收，避免与水稻“双抢”在季节上产生矛盾。夏大豆和秋大豆适当早播也可对早收，对避过或减轻秋旱危害有利。第四，适当早播的春大豆，前期气温较低，植株生长稳健，矮壮节密，花荚多，产量高。夏大豆和秋大豆适当早播可适当延长营养生长期；植株生长繁茂，“骨架”长得壮，花荚多，产量自然较高。基于上述理由，播种期强调一个“早”字的好处是很明显的。农民说：“一造早，三造好”就是这个道理。</p><p><br></p><p>八、播种方法</p><p><br></p><p><br></p><p>现在生产上应用的大豆的播种方法有：窄行密植播种法、等距穴播法、60厘米双条播、精量点播法、原垄播种、耧播、麦地套种、板茬种豆等。</p><p>1.窄行密植播种法</p><p>缩垄增行、窄行密植，是国内外都在积极采用的栽培方法。改60-70厘米宽行距为40-50厘米窄行密植，一般可增产10%-20%。从播种、中耕管理到收获，均采用机械化作业。机械耕翻地，土壤墒情较好，出苗整齐、均匀。窄行密植后，合理布置了群体，充分利用了光能和地力，并能够有效地抑制杂草生长。</p><p><br></p><p>2.等距穴播法</p><p><br></p><p>机械等距穴播提高了播种工效和质量。出苗后，株距适宜，植株分布合理，个体生长均衡。群体均衡发展，结荚密，一般产量较条播增产10%左右。</p><p><br></p><p>3.60厘米双条播</p><p><br></p><p>在深翻细整地或耙茬细整地基础上，采用机械平播，播后结合中耕起垄。优点是，能抢时间播种，种子直接落在湿土里，播深一致，种子分布均匀，出苗整齐，缺苗断垄少机播后起垄，土壤疏松，加上精细管理，故杂草也少。</p><p><br></p><p>4.精量点播法</p><p>在秋翻耙地或秋翻起垄的基础上刨净茬子，在原垄上用精量点播机或改良耙单粒、双粒平播或垄上点播。能做到下籽均匀，播深适宜，保墒、保苗，还可集中施肥，不需间苗。</p><p><br></p><p>5.原垄播种</p><p>为防止土壤跑墒，采取原垄茬上播种。这种播法具有抗旱、保墒、保苗的重要作用，还有提高地温、消灭杂草，利用前茬肥和降低作业成本的好处。多在干旱情况下应用。</p><p>6.耧播</p><p>黄淮海流域夏播大豆地区，常采用此法播种。一般在小麦收割后抓紧整地，耕深15-16厘米，耕后耙平耪实，抢墒播种。在劳力紧张、土壤干旱情况下，一般采取边收麦、边耙边灭茬，随即用耧播种。播后再耙耪1次，达到土壤细碎平整以利出苗。</p><p>7.麦地套种</p><p>夏播大豆地区，多在小麦成熟收割前，于麦行里套种大豆。一般5月中下旬套种，用楼式镐头开沟，种子播于麦行间，随即覆土镇压。</p><p><br></p><p>8.板茬种豆</p><p><br></p><p>湖南、广西、福建、浙江等南方省份种植的秋大豆多采用此法。一般在7月下旬至8月上旬播种。适时早播为佳，在早稻或中稻收获前，即先排水露田，但不能排得过干，水稻收后在原茬行上穴播种豆。一般每亩1万株左右，每穴2-3株，播完后第二天再漫灌催芽水，浸泡5-6小时后，将水排干。</p><p><br></p>',1,'张三',1742169110809092099,'2024-02-08 03:16:55','2024-02-08 03:16:55',8,0,NULL,'一、土壤准备\n\n\n\n1、播前整地：播前整地包括播前'),(1755310239448473602,'大豆高产栽培技术要点','<p><br></p><p>大豆高产栽培技术要点主要包括以下几个方面：</p><p><br></p><p>1.&nbsp;选用优质品种：选择蛋白质含量45%或脂肪含量22%或蛋白质与脂肪总含量63%的优质标准品种。此外，要选择有限结荚习性或亚有限结荚习性、株型收敛、叶形中小、有利于通风透光、株高中等偏上、分枝3-5个、单株荚数50-60个、生育期85-105天、具有高产潜力的品种。</p><p><br></p><p>2.&nbsp;种子质量：种子质量好坏直接关系到大豆苗全、苗齐、苗壮。播种前必须进行人工或机械选种，选用粒大、饱满、没有病虫害和杂质的种子作良种。机械和人工粒选应剔除病斑粒、虫食粒、破损粒及杂质，使种子质量达到纯度不低于98%，净度不低于98%，发芽率高于90%，含水量不高于13%的标准。</p><p><br></p><p>3.&nbsp;种子包衣：播种前可用大豆种衣剂按药种比1（75～100）包衣，防治地下害虫和根腐病等病虫害，播前晒种1-2天。</p><p><br></p><p>4.&nbsp;茬口选择：大豆对茬口要求严格，重茬会加重病虫害的发生。尽量选择轮作地块，避免连续种植同一品种或同一类作物。</p><p><br></p><p>5.&nbsp;合理播种：根据当地气候条件和土壤肥力，确定合适的播种期和播种量。播种深度一般在3-5厘米，播种后及时覆土、压实。</p><p><br></p><p>6.&nbsp;田间管理：适时浇水、施肥，保持土壤湿润，促进大豆生长。注意观察病虫害情况，及时采取措施防治。大豆生长过程中，要进行适当的除草、松土、培土等管理工作。</p><p><br></p><p>7.&nbsp;适时收获：大豆成熟时，豆荚颜色变黄、豆粒充实饱满，应及时收获。收获时避免损坏豆荚，影响产量和品质。</p><p><br></p><p>8.&nbsp;储存：收获的大豆应妥善储存，防止受潮、发霉、变质。一般将大豆晾晒至水分低于13%后，放入通风、干燥的仓库储存。</p><p><br></p><p>综上所述，大豆高产栽培技术要点包括选用优质品种、保证种子质量、合理播种、加强田间管理、适时收获和储存等。在实际栽培过程中，要根据当地气候、土壤等条件，灵活调整管理措施，以实现大豆的高产丰收。</p><p><br></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/9bb77663-d019-4adc-8367-a20460ec9a99.jpg\" width=\"320px\" data-local=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/9bb77663-d019-4adc-8367-a20460ec9a99.jpg\"></p><p><br></p>',3,'张三',1742169110809092099,'2024-02-08 03:19:08','2024-02-08 03:19:08',18,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/9bb77663-d019-4adc-8367-a20460ec9a99.jpg','大豆高产栽培技术要点主要包括以下几个方面：\n\n1'),(1755310377868894209,'大豆技术','<p><strong>一、土壤准备</strong></p><p><br></p><p><br></p><p><br></p><p>1、播前整地：播前整地包括播前进行的土壤耕作及耙、耪、压等。由于采用了不同的整地技术，因此，播前整地工作也有所不同。如平翻、垄作、耙茬、深松等。</p><p><br></p><p>2、播前灌溉：对于墒情不好的地块，有灌溉条件的，可在播前1-2天灌水1次，浸湿土壤即可，以利播后种子发芽。</p><p><br></p><p>3、播前封闭除草：我国东北大豆主产区一些大型农场，大豆栽培面积大，如管理不及时，则杂草为害严重，常在播前采用机械喷施除草剂，进行大田封闭除草。氟乐灵等除草剂可在播前进行土壤喷雾。用氟乐灵可有效防除1年生禾本科杂草和某些1年生阔叶草。</p><p><br></p><p><strong>二、精选种子</strong></p><p><br></p><p><br></p><p><br></p><p>具有良好播种品质的种子，发芽率和发芽势高，苗整齐茁壮。所以在播种前应将病粒、虫蛀粒、小粒、秕粒和破瓣粒拣出。同时还要根据本品种固有的典型特征，如粒型、粒色、种子大小、种脐大小和颜色深浅，剔除混杂的异品种种子，以提高种子纯度。采用人工粒选的效果很好，如果用种量大，可采用螺旋式大豆粒选机，其机械结构简单，便于移动，适合大豆种植专业户应用。精选净度要求达97%以上，纯度98%以上。</p><p><br></p><p><br></p><p><strong>三、种子测定和发芽试验</strong></p><p><br></p><p>经过精选的种子在播种前应测定粒重和做发芽率试验。这两项工作是计算播种量的根据。将经过精选的种子，随机取样3份，每份随机抽出100粒种子，各自称重并求出平均数，即为该品种的百粒重。其单位用克表示。种子发芽率测定：将上述3份各100粒种子，分别放人3个小蝶或发芽皿中，下垫草纸或河沙。加水至薄水层，然后将种子均匀摆好，放在20℃左右温暖处(灶旁或保温箱内)吸水膨胀发芽。经过5-7天计算能正常长根发芽的种子数，并将3个样本加以平均，即为该种子的发芽率。要求发芽率95%以上。</p><p><br></p><p><strong>四、种子处理</strong></p><p><br></p><p>为防治蛴螬、地老虎、根蛆、根腐病等苗期病虫害，常用种子量0.3%-0.4%多菌灵加福美双(1:1)，或用0.3%-0.5%多菌灵加克菌丹(1:1)拌种。要注意采用根瘤菌拌种后，不能再拌杀虫剂和杀菌剂。</p><p><br></p><p><strong>五、播种量的确定</strong></p><p><br></p><p><br></p><p>第一步，将已测定的某品种百粒重换算成每千克粒数。如某品种测得百粒重为20克，则每千克粒数为：100粒*1000克÷20克＝5000粒。</p><p><br></p><p>第二步，计算每667平方米播种粒数。根据实际情况计算出每667平方米保苗株数，然后按照当地耕作条件和管理水平，加上一定数量的损失率(如机械、人、畜在田间管理过程中和人工间苗所造成的损失)，一般田间损失率可按15％-20％计算。单位面积上计划保苗数加田间损失率，即为每667平方米(1亩)播种粒数。如某品种计划每667平方米保苗2.5万株，田间损失率估计为20％，则每667平方米播种粒数为：每667平方米播种粒数：25000十25000*20％＝30000粒</p><p>第三步，计算每667平方米播种量。其公式如下：每667平方米播种量（千克）=每667平方米播种粒数/（每千克种子粒数*发芽率）。例如，计划每667平方米播种30000粒，已测得每千克种子粒数为5000粒，已测得发芽率为95％。代人公式：每667平方米播种量：30000/（50000*0.95)=6.3(千克)。</p><p><br></p><p><strong>六、合理密植</strong></p><p><br></p><p>种植密度与产量有密切关系。所谓合理密植是指在当地、当时的具体条件下，正确处理好个体和群体的关系，使群体得到最大限度的发展，个体也得到充分发育；使单位面积上的光能和地力得到充分利用；在同样的栽培条件下，能获得最好的经济效益。因此，一个适宜的密度不是一成不变的，不能简单地讲“肥地宜稀，瘦地宜密”，主要应考虑以下因素：</p><p><br></p><p>1.品种：品种的繁茂程度，如植株高度、分枝多少、叶片大小等与密度的关系密切。凡植株高大，分枝较多，株型开展，大叶型品种，种植密度宜小；植株矮小，繁茂性差的品种，或植株虽较高，但分枝少，株型收敛的品种，宜采用较大的密度。</p><p><br></p><p>2.肥水条件：同一品种在肥水条件较好时，植株生长繁茂，密度宜小；反之，肥水条件差，密度应较大。试验表明：土壤肥力和施肥水平与种植密度有密切关系。</p><p><br></p><p>3.品种类型和种植季节：一般春大豆生育期较长，植株高大，种植密度宜稀；夏大豆生育期较短，秋大豆生育期最短，植株也较矮小，宜适当密植。</p><p><br></p><p>以上是确定播种密度的一般原则。由于各地的气候、土壤条件不同，栽培制度各异，管理水平和种植的品种不一，不可能统一种植同一个密度。一般可参考下列种植密度：</p><p><br></p><p>（1）北方春大豆的播种密度</p><p><br></p><p>在肥沃土地，种植分枝性强的品种，亩保苗0.8-1万株为宜。在瘤薄土地，种植分枝性弱的品种，亩保苗1.6-2万株为宜。高纬度高寒地区，种植的早熟品种，亩保苗2-3万株。在种植大豆的极北限地区，极早熟品种，亩保苗3-4万株。</p><p><br></p><p>（2）黄淮平原和长江流域夏大豆的播种密度</p><p><br></p><p>一般每亩1.5-3万株。平坦肥沃，有灌溉条件的土地，亩保苗1.2-1.8万株。肥力中等及肥力一般的地块，亩保苗2.2-3万株为宜。</p><p><br></p><p><strong>七、播种期</strong></p><p><br></p><p><br></p><p>播种期早晚对产量和品质的影响非常大。播种过早、过晚，对大豆生长发育均不利。适时播种，保苗率高，出苗整齐、健壮，生育良好，茎秆粗壮。播种过晚，出苗虽快，但苗不健壮，如遇墒情不好，还会出苗不齐。北方区，晚熟品种易遭早霜危害，有贪青晚熟减产的危险。播种过早，在东北地区，由于土壤温度低，发芽迟缓，易发生烂种现象。</p><p><br></p><p><br></p><p>地温与土壤水分是决定春播大豆适宜播种期的两个主要因素。一般认为，北方春播大豆区，土壤5-10厘米深的土层内，日平均地温8-10℃时，土壤含水量为20%左右，播种较为适宜。所以，东北地区大豆适宜播种期在4月下旬至5月中旬，其北部5月上中播种，中部4月下旬至5月中旬播种，南部4月下旬至5月中旬播种；北部高原地区4月下旬至5月中旬播种，其东部5月上中旬播种，西部4月下旬至5月中旬播种；西北地区4月中旬至5月中旬播种，其北部4月中旬至5月上旬播种，南部4月下旬至5月中旬播种。</p><p><br></p><p><br></p><p><br></p><p>黄淮海区和南方区大豆种植区，大豆的播期受后茬和后期低温的制约。黄淮海区夏播大豆6月中下旬播种。南方区，长江亚区夏播大豆5月下旬至6月上旬播种，春播大豆4月上旬至5月上旬播种;东南亚区，春大豆3月下旬至4月上旬播种，夏大豆5月下旬至6月上旬播种，秋大豆7月下旬至8月上旬播种；中南亚区，春大豆3月下旬至4月上旬播种，夏大豆6月上中旬播种，秋大豆7月中旬至8月上旬播种；西南亚区，春大豆4月份播种，夏大豆5月上中旬播种;华南亚区，春大豆2月下旬至3月上旬播种，夏大豆5月下旬至6月上旬播种，秋大豆7月份播种，冬大豆12月下旬至翌年1月上旬播种。</p><p><br></p><p>夏播和秋播大豆由于生长季节较短，适期早播很重要。另外，播种期也可根据品种生育期类型、地块的地势等加以适当调整。晚熟品种可早播，中、早熟品种可适当后播。春早，地温、地势高的，可早些播种，土壤墒情好的地块可晚些播，岗平地可以早些播种。</p><p><br></p><p><br></p><p><br></p><p>为什么要强调适时早播呢？首先，春大豆适时早播，有利于第二造、第三造作物按时抢上季节，不违农时。第二，春大豆适当早播，可以相对早收，能避开第二代豆荚螟为害高峰期。第三，春大豆早播可以相对早收，避免与水稻“双抢”在季节上产生矛盾。夏大豆和秋大豆适当早播也可对早收，对避过或减轻秋旱危害有利。第四，适当早播的春大豆，前期气温较低，植株生长稳健，矮壮节密，花荚多，产量高。夏大豆和秋大豆适当早播可适当延长营养生长期；植株生长繁茂，“骨架”长得壮，花荚多，产量自然较高。基于上述理由，播种期强调一个“早”字的好处是很明显的。农民说：“一造早，三造好”就是这个道理。</p><p><br></p><p><strong>八、播种方法</strong></p><p><br></p><p><br></p><p>现在生产上应用的大豆的播种方法有：窄行密植播种法、等距穴播法、60厘米双条播、精量点播法、原垄播种、耧播、麦地套种、板茬种豆等。</p><p>1.窄行密植播种法</p><p>缩垄增行、窄行密植，是国内外都在积极采用的栽培方法。改60-70厘米宽行距为40-50厘米窄行密植，一般可增产10%-20%。从播种、中耕管理到收获，均采用机械化作业。机械耕翻地，土壤墒情较好，出苗整齐、均匀。窄行密植后，合理布置了群体，充分利用了光能和地力，并能够有效地抑制杂草生长。</p><p><br></p><p>2.等距穴播法</p><p><br></p><p>机械等距穴播提高了播种工效和质量。出苗后，株距适宜，植株分布合理，个体生长均衡。群体均衡发展，结荚密，一般产量较条播增产10%左右。</p><p><br></p><p>3.60厘米双条播</p><p><br></p><p>在深翻细整地或耙茬细整地基础上，采用机械平播，播后结合中耕起垄。优点是，能抢时间播种，种子直接落在湿土里，播深一致，种子分布均匀，出苗整齐，缺苗断垄少机播后起垄，土壤疏松，加上精细管理，故杂草也少。</p><p><br></p><p>4.精量点播法</p><p>在秋翻耙地或秋翻起垄的基础上刨净茬子，在原垄上用精量点播机或改良耙单粒、双粒平播或垄上点播。能做到下籽均匀，播深适宜，保墒、保苗，还可集中施肥，不需间苗。</p><p><br></p><p>5.原垄播种</p><p>为防止土壤跑墒，采取原垄茬上播种。这种播法具有抗旱、保墒、保苗的重要作用，还有提高地温、消灭杂草，利用前茬肥和降低作业成本的好处。多在干旱情况下应用。</p><p>6.耧播</p><p>黄淮海流域夏播大豆地区，常采用此法播种。一般在小麦收割后抓紧整地，耕深15-16厘米，耕后耙平耪实，抢墒播种。在劳力紧张、土壤干旱情况下，一般采取边收麦、边耙边灭茬，随即用耧播种。播后再耙耪1次，达到土壤细碎平整以利出苗。</p><p>7.麦地套种</p><p>夏播大豆地区，多在小麦成熟收割前，于麦行里套种大豆。一般5月中下旬套种，用楼式镐头开沟，种子播于麦行间，随即覆土镇压。</p><p><br></p><p>8.板茬种豆</p><p><br></p><p>湖南、广西、福建、浙江等南方省份种植的秋大豆多采用此法。一般在7月下旬至8月上旬播种。适时早播为佳，在早稻或中稻收获前，即先排水露田，但不能排得过干，水稻收后在原茬行上穴播种豆。一般每亩1万株左右，每穴2-3株，播完后第二天再漫灌催芽水，浸泡5-6小时后，将水排干。</p>',3,'张三',1742169110809092099,'2024-02-08 03:19:41','2024-02-15 01:09:29',14,0,NULL,'一、土壤准备\n\n\n\n1、播前整地：播前整地包括播前'),(1755311637833621506,'乡村振兴范文1','<p><strong>乡村振兴范文1</strong></p><p>党的十九大和中央农村工作会议提出全面实施乡村振兴战略，并将其提升到战略高度、写入党章，把农业农村工作摆在更加重要地位，为农业农村改革发展指明了航向。农村的“面子”就是中国的“里子”，只有让农业成为有奔头的产业，让农民成为有吸引力的职业，让农村成为安居乐业的美丽家园，才能走出一条中国特色的乡村振兴道路。</p><p><br></p><p><strong>一、乡村基础现状</strong></p><p><br></p><p>1、农业产业竞争弱。县内蔬菜及其他农产品拥有一些品牌，但由于规模小、市场份额占有率低，真正有辐射效应的品牌产品不多，知名品牌更少，产品宣传力度小，申报注册步伐慢。在产品质量上重视程度不够，有的有名无牌，有的有牌无名，缺乏市场竞争力。</p><p><br></p><p>2、主体作用发挥差。由于多数行政村集体经济实力有限、农民素质不高，很多群众对乡村振兴是“知其然不知其所以然”，认为乡村振兴是政府的事，等靠要思想严重，缺乏主人翁意识，参与热情不高，出现了“上头热、下头冷”的现象。</p><p><br></p><p>3、农村环境污染重。生活污水、农药化肥、生活垃圾和人畜粪便等成为农村环境污染的主要原因，使农村地区环境状况日益恶化，大部分行政村未建有生活污水处理设施，乱排乱倒现象严重，破坏水体生态，危害人居生存环境。</p><p><br></p><p>4、三大产业融合程度低。新型农业经营主体发展迟缓，农村产业融合型人才缺乏，农业产业规模不大，带动能力弱，与二三产业融合程度低、层次浅，链条短，附加值不高。</p><p><br></p><p>5、乡村文化项目贫乏。乡村精神文明建设整体创建水平不高、活动不深入、载体不丰富、机制不健全、方法较单一，打架斗殴、聚众赌博、封建迷信、大操大办等在一定范围内存在，乡村文化项目单一，群众文明素养、文明习惯有待提高。</p><p><br></p><p>6、基础设施欠账多。由于历史欠帐，以及发展不平衡不充分，乡村道路、供排水、教育、卫生、文化等基础条件依然与城镇比、与发达地区比有较大差距，与乡村振兴要求相比更有很大差距。</p><p><br></p><p>7、实用人才不足。农业技术人才短缺、大学生村官、村两委干部、脱贫致富带头人等农村实用人才不足成为制约乡村振兴的重要因素，技术服务不到位制约着我县农业产业的发展，农业部门技术力量严重不足，近年来承担工作逐年加大，但人员减少和专业技术人员匮乏问题始终未能解决。</p><p><br></p><p><strong>二、实施乡村振兴，完善乡村村基础设施建设。</strong></p><p><br></p><p>首先，坚持以工补农，以城带乡，把公共基础设施建设的侧重点放在农村，推动农村基础设施建设提档升级。发展乡镇企业，实现劳动力内部转移，鼓励民营企业投资农村基础设施建设。把民营企业作为全面搞好农村基础设施建设的重要载体，通过政策引导、财政扶持、税收减免等优惠政策，鼓励、引导和支持大型民企投资农村。其次，优先发展农村教育事业，优化教育资源的配置，提高农村教育质量。全县学校布局进一步优化，各乡镇建起了乡村及城镇化寄宿制学校，义务教育标准化建设成效显著，教育公平一盘棋的深度融合，推进了城乡学校布局一体化。最后，完善农村社会医疗保障体系建设，推进健康乡村建设。国家现在对医保这块投入越来越大，可报销比例和范围不断扩大，但是目前还有很多人没有缴纳医保的费用，认为那是花“冤枉钱”。面对村民的\'不信任，我们要贴心，细心、耐心地讲解医保的作用，让每一位村民都可以享受到医保，不至于“救护车一响，一头猪白养”。逐步建立健全全民覆盖，普惠共享的基本公共服务体系，让更多人放心看病。</p><p><br></p><p><strong>三、实施乡村振兴，厚植乡村文化底蕴。</strong></p><p><br></p><p>一是实施文明培育工程，促进了乡村文明程度的提高。由县直单位、乡镇政府、各村委会组织开展活动，以城带乡，城乡共建，将移风易俗与“我们的节日”、“三下乡”活动有效结合起来，在全县举办“崇尚科学、破除迷信、拒绝邪教”科普宣教活动，通过规范红白理事会，制定村规民约，春节送春联、送吊挂，移风易俗文艺晚会展演等形式，教育引导广大群众破除封建迷信、树立文明新风。二是将文化元素注入乡村建设。在美丽乡村建设中，坚持以文化为魂，将剪纸、武术、民歌闽南戏曲、芗剧等传统文化图文并茂地融入到镇村建设中，在基层镇村举办戏剧比赛、象棋比赛、广场舞比赛、农民篮球赛、武术比赛等文体赛事，着力突出公共服务和文化建设，21个乡镇综合文化站、村级农家书屋实现全覆盖，文化信息共享工程有序推进，“村村通”实现行政村全覆盖。大力发展文化的产业化，提升文化底蕴，让乡村文化真正做到移风易俗。</p><p><br></p><p><strong>四、实施乡村振兴，转变乡村农业发展导向。</strong></p><p><br></p><p>最大化利用资源，培育新型农业主体。面对农村“地多劳动力流失”的情况，可以形成以农户家庭承包经营为基础，以合作与联合为纽带的现代农业经营体系；对于农村闲置土地，一方面应加大土地流转力度，解决土地碎片化问题，另一方面应成立种植合作社或引入第三方合作，解决劳动力外出流失的问题。因地制宜发展一村一品，提升农村经济实力。农民是农村的主体，要扩大农民的参与度，积极引进资源，形成“乡镇企业+农户或专业合作社+农户”产业化的经营模式。在立足本村优势的基础上，注重产品质量，多元化思考提升产品附加值。寻找传统文化与现代元素的契合点，打造属于本村的特色经济产品。加强一、二、三产业关联度，着力发展现代农业产业体系。各村在发展的过程中，应充分发挥市场的导向作用，积极了解并顺应惠农政策，充分调动各类市场主体参与到发展中，打破产业之间的界限，形成一、二、三产业交叉融合发展，开展电商服务，发展“互联网+”模式，借助“电商”平台推广农产品，引导农民、农业从“生产导向”向“消费导向”转变的“新农人”“新业态”。</p><p><br></p><p><strong>五、实施乡村振兴，构建脱贫致富长效机制。</strong></p><p><br></p><p>着实摸清贫困人口家底，明确扶贫思路。乡镇驻村领导、驻村工作队长和村两委干部开展入户走访，详细了解贫困户家庭情况，核对贫困户家庭生活情况，做到应纳尽纳、应退尽退、应扶尽扶。着力落实造福工程、危房改造，保障贫困户住房问题。镇、村两级通力协作，全力摸排易地搬迁对象，开展定期或不定期的跟踪督查，督促贫困户加快确定建房地址、抓紧动工、加快建设进度，早日住上新房。着实做好产业扶贫项目，带领贫困户脱贫致富。围绕乡镇产业发展，充分发挥乡镇地区优势和产业特点，进一步完善基础设施建设，重点培育特色产业，积极鼓励和支持贫困户发展支柱产业，以发展生态养殖、特色种植、办理小额贷款等帮扶模式将“结对”贫困户推上了快速脱贫致富的“快车道”。</p><p><br></p><p><strong>六、实施乡村振兴，培育乡村实用人才。</strong></p><p><br></p><p>加强“三农”工作队伍的管理，培养一支懂农业、爱农村、爱农民的农村工作队伍，带动农民收入稳定增长，增强乡村基层组织的凝聚力，让乡村成为人民向往的美丽家园，实现新时代乡村现代化。切实把加强乡村实用人才队伍建设摆上重要日程，组织部、农业局应联合举办乡村实用人才带头人和大学生村官示范培训班，大力度高频次培育乡村实用人才，设置创业富民、新型农业经营、大学生村官能力建设、农业农村电子商务等主题培训班。培训对象的遴选要具针对性，一是重点面向贫困地区，二是遴选村级党组织书记及村“两委”其他成员、大学生村官、新型农业经营主体负责人、带领农民群众脱贫致富的带头人等。各地高校要负责培养一批内心真正为民生为国家做贡献、做牺牲的毕业生，培养他们的综合素质，把真正适合农村工作的人选拔进来，在农村这片热土上，留下踏踏实实在基层服务的干事人，留下兢兢业业的逐梦者。</p><p><br></p><p><strong>七、实施乡村振兴，助力乡村绿色发展。</strong></p><p><br></p><p>没有完好生态环境的乡村是病态的，不完整的，乡村振兴，应该绿色先行，这就需要我们加大生态环境的保护力度。开展乡村垃圾治理，抓好建章立制，建立和完善管理范围内的环境卫生管理制度和措施，理顺管理机制，制定农村环境管理和督查、环卫设施管理、清扫保洁、垃圾清运等相关配套制度，形成长效机制。开展乡村污水治理，各乡镇主动履职、敢于负责、镇村联动、合力攻坚，乡镇政府要主动牵头，自觉履行属地管理责任，齐心协力，协调配合，凝聚工作合力，严格执法，为环境污染综合整治工作提供有力保障。开展村容村貌治理，各乡镇开展环境卫生集中整治，集中清理乱搭乱建、乱推乱放、乱写乱画，做好“五清”，提升村容村貌亮化美化。开展乡村畜禽养殖污染治理，各乡镇要加大畜禽养殖污染的打击力度，切实把责任放在心上、扛在肩上、抓在手上，以铁的决心、铁的措施坚决将整治落实到位，对违法行为决不能姑息，切实做到禁养区内养殖场所一律取缔；可养区内无证养殖的坚决予以打击，正在办理手续的，一律停办。要狠下决心重拳出击，合力抓好畜禽退养整治工作，做到零复养、零延伸。开展乡村矿山及废弃矿渣整治，持续加大矿山整治力度，落实监管责任，加大打击力度，加强矿山修复、狠抓专项行动，坚决打赢“蓝天保卫战”。</p><p><br></p><p>九层之台起于累土，千里之行始于足下。乡村振兴关乎全国人民的幸福指数，用富民之美给村民一个富足的生活条件，用生态之美给游子一个身心休憩的家园，用强业之美给城归一个xxx发展的生机，只有走上富民、村美、强业的多赢之路，才会实现乡村宜居安康的振兴之梦。</p>',1,'张三',1742169110809092099,'2024-02-08 03:24:41','2024-02-15 01:07:52',16,0,NULL,'乡村振兴范文1\n党的十九大和中央农村工作会议提出全'),(1755311768377139201,'乡村振兴范文2','<p><strong>乡村振兴范文2</strong></p><p><br></p><p>xxx总书记在十九大报告中指出：实施乡村振兴战略，农业农村农民问题是关系国计民生的根本性问题，必须始终把解决好“三农”问题作为全党工作重中之重。乐至县作为四川省的“乡村振兴规划试点县”，要坚持以xxx新时代中国特色社会主义思想为指导，全面贯彻党的.十九大精神和xxx总书记对四川工作重要指示精神，按照“产业兴旺、生态宜居、乡风文明、治理有效、生活富裕”总要求，推动乡村产业、人才、文化、生态、组织“五个振兴”,实现农业全面升级、农村全面进步、农民全面发展。</p><p><br></p><p><br></p><p><br></p><p><strong>一、农业、农村、农民现状</strong></p><p><br></p><p><br></p><p><br></p><p>（一）农业农村基础设施滞后</p><p><br></p><p><br></p><p><br></p><p>全县农业基础条件差，田地分散，地块较小，不利于农业机械化生产。农业基础设施欠账多，水利设施老化严重，近年来，虽然实施了高标准农田改造项目、水利设施建设项目和村村通水泥路项目，但从全县来看，比例仍然偏小，“田网、路网、渠网”等配套设施仍不完善，农业靠天吃饭的格局没有得到根本改变。项目支撑能力不强，缺乏统一规划，项目打捆使用，农口部门之间没有很好好契合，各行其事，各自为阵，造成有项目无产业，有产业无项目支撑。</p><p><br></p><p><br></p><p><br></p><p>（二）农业经营者素质不高</p><p><br></p><p><br></p><p><br></p><p>受传统农业的影响，我县农业以家庭为单位的传统小农生产方式居多，农户经营较为分散，直接导致产业规模小，很难进行规模化种植、集约化管理和标准化生产。农村人员结构老化，18-60岁真正意义的劳动力资源严重不足，人才断代现象突出，人员年龄结构、知识结构已不能满足农业发展需要；农业产业经营管理人才和专业技术人才双双短缺，部分乡镇农技部门有的农技人员往往身兼数职，无法全身心投入农村技术推广工作，同时基层农技员知识更新有待进一步加强。</p><p><br></p><p><br></p><p><br></p><p>（三）农业产业化程度不高</p><p><br></p><p><br></p><p><br></p><p>我县龙头企业（业主）发展规模较小，示范引领作用不强，部分农民专业合作社运行不规范、利益联结机制不完善，社会化组织程度不高、辐射带动效果不显著，导致新型农业经营主体未能充分发挥示范作用。目前我县农产品交易市场平台建设滞后，交易方式单一落后，市场信息不对称，农产品产销难对接，农产品产业链的各环节基本是分离的。农产品流通市场、农产品销售还缺乏全方位的信息引导，缺乏及时、准确、系统、权威的生产、技术、价格和供求信息，其指导生产、引导销售的功能没有得到充分的发挥。</p><p><br></p><p><br></p><p><br></p><p>(四）基层政府服务能力不强</p><p><br></p><p><br></p><p><br></p><p>乡镇的工作环境和生活条件相对艰苦，难以吸引优秀人才，加上进人渠道窄，影响了干部补充，且优秀人才容易被上级部门挖走，造成乡镇干部队伍结构失衡、人员老化、青黄不接、断层严重。部分乡镇中年干部由于学历和知识层次偏低，对新形势下的农村经济社会发展认识不到位，接受新事物、新观点、新知识的能力较弱，习惯于用传统的方法解决新问题，在落实示范带动、农业产业开发中，缺乏创新能力，点子不多，办法不实用。部分乡镇年轻干部，由于缺乏基层工作经验，组织动员群众能力差，面对实际困难时往往显得办法不实用，与群众打交道存在障碍。部分干部存在“不求有功，但求无过”的懈怠思想，缺乏勇于担当的创新意识和进取精神，贻误了发展良机，造成了工作被动。</p><p><br></p><p><br></p><p><br></p><p><strong>二、建议意见</strong></p><p><br></p><p><br></p><p><br></p><p>（一）加强“三农”工作队伍建设</p><p><br></p><p><br></p><p><br></p><p>高度重视农业农村干部的培养、配备、管理和使用，切实加强思想政治建设、作风建设、能力建设，培养造就一支懂农业、爱农业、爱农民的“三农”工作队伍，为建设丘区现代农业强县提供全方位人才保证。一要扎实推进思想政治建设。坚持将政治建设摆在农业干部队伍建设的首要位置，切实加强党性教育、宗旨教育、警示教育，教育引导党员干部牢固树立“四个意识”，准确把握“三农”工作“重中之重”的战略定位，从政治高度认识做好“三农”工作的重要性，更加自觉地在思想上政治上行动上同党中央保持高度一致。二要扎实推进纪律作风建设。深入开展整治和查处侵害群众利益的不正之风和腐败问题，持续开展正风肃纪，坚决纠正不正之风，大兴敢于担当、狠抓落实、为民服务、调查研究、清正廉洁之风，在全县积极营造风清气正的良好环境，牢固树立农业系统干部良好形象。三要扎实推进业务能力建设。坚持在加强新品种、新技术、新装备、新模式等业务知识学习的同时，引导农业干部职工更加注重运用市场、法治、信息化和以点带面的方法推动工作，不断提升服务“三农”工作的能力。</p><p><br></p><p><br></p><p><br></p><p>（二）加快培育新型农业经营主体</p><p><br></p><p><br></p><p><br></p><p>加快建立教育培训、规范管理和政策扶持“三位一体”的新型职业农民培育体系，培育一批专业化程度深、分工明细、服务水平高的新型职业农民、农村经纪人、职业农业经理人，扶持一批龙头企业、专合组织、家庭农场等新型经营主体。大力发展多种形式的新型经营主体，推行“保底收益+二次分红”“龙头企业+专业合作社+适度规模专业农户”等模式，促进现代农业发展和农民增收。推进农业社会化服务主体多元化、形式多样化、运作市场化，提供农业技术推广、优良品种引进、动植物疫病防控、质量检测检验、农资供应和市场营销等服务，使农民享受到低成本、便利化、全方位的社会化服务。坚持示范引领、创新推动，创建一批省市级示范社、示范农场。</p><p><br></p><p><br></p><p><br></p><p>（三）大力推进农村基础设施建设</p><p><br></p><p><br></p><p><br></p><p>加强农村生产、生活、生态环境等方面的基础设施建设是农业和农村发展的有力支撑。一要实施农村饮水安全巩固提升工程，综合采取改造、配套、升级、联网等方式，进一步提高城镇供水设施覆盖行政村比率、农&nbsp;村集中供水率、自来水普及率、供水保证率、水质达标率，加强农村饮用水水源保护和水质检测能力建设。二要推广和实施农村清洁能源，加强对生物质节能炉具、秸秆固化综合利用、沼气、太阳能节能房等新能源、新技术的推广利用，积极引导农村能源结构的转变。三要大力实施高标准农田改造项目、水利设施建设项目和村社通水泥路项目，完善“田网、路网、渠网”等配套设施，改变农业靠天吃饭的格局。四要农村危房改造工作，切实保障农民住房安全。</p><p><br></p><p><br></p><p><br></p><p>（四）加大农业项目资金整合</p><p><br></p><p><br></p><p><br></p><p>充分利用国家支农惠农政策，加大农业项目资金整合，注重产业发展的科学合理规划和扶持政策的连续性，实现产业化基地建设的快速健康发展，最大限度地为龙头企业提供优质安全的原料，实现种植业产业链更加紧密有效。积极争取各级政府、部门对我县畜牧业绿色发展的政策、资金、项目支持，合理利用政策、打捆项目资金、科学安排落实，最大化发挥政策和资金的杠杆作用，撬动市场资本，助推全县畜牧业发展壮大。加快推动生物有机肥厂项目建设，建立覆盖饲养、屠宰、经营、运输等各环节的病死畜禽无害化处理体系，实现农业废弃物无害化综合利用，促进现代农业转型升级，形成政府、企业、社会共同参与的综合治理机制。</p><p><br></p>',1,'张三',1742169110809092099,'2024-02-08 03:25:12','2024-02-15 01:08:32',20,0,NULL,'乡村振兴范文2\n\nxxx总书记在十九大报告中指出：'),(1755313118309687298,'湖南-岳阳楼腐乳','<p>湖南-岳阳楼腐乳</p><p>湖南岳阳楼腐乳源于长江流域，历经几百年发展，已成为许多地方的标志性特产。它是中国传统的发酵豆制品，具有鲜香浓郁的口感，适用于卤肉饭、炒菜和拌豆芽等多种菜肴。</p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/4db43e31-d01f-463b-903c-5cfe52a428d9.png\" width=\"320px\" data-local=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/4db43e31-d01f-463b-903c-5cfe52a428d9.png\"></p>',2,'张三',1742169110809092099,'2024-02-08 03:30:34','2024-02-08 20:37:36',37,0,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/4db43e31-d01f-463b-903c-5cfe52a428d9.png','湖南-岳阳楼腐乳\n湖南岳阳楼腐乳源于长江流域，历经'),(1756907722679177217,'问题发布测试','<p><strong>问题发布测试</strong></p><p>哈哈哈哈哈😄</p><p><span style=\"color: red;\">红色字体</span></p>',4,'1222222',1755527534073651201,'2024-02-12 13:06:58','2024-02-12 13:06:58',25,0,NULL,'问题发布测试\n哈哈哈哈哈😄\n红色字体');
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chart`
--

DROP TABLE IF EXISTS `chart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chart` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '轮播图id',
  `url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '轮播图url地址',
  `type` bigint NOT NULL COMMENT '轮播图类型：1.首页、2.就业、3.商城',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chart`
--

LOCK TABLES `chart` WRITE;
/*!40000 ALTER TABLE `chart` DISABLE KEYS */;
INSERT INTO `chart` VALUES (1,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/home/1.png',1),(2,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/home/2.png',1),(3,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/home/3.png',1),(4,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/home/4.png',1),(5,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/job/1.jpg',3),(6,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/job/2.jpg',3),(7,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/shop/1.jpg',2),(8,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/shop/2.jpg',2),(9,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/chart/shop/3.jpg',2);
/*!40000 ALTER TABLE `chart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comments`
--

DROP TABLE IF EXISTS `comments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comments` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '评论id',
  `article_id` bigint NOT NULL COMMENT '文章id',
  `user_id` bigint NOT NULL COMMENT '发布评论的用户的id',
  `comment` mediumtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '评论内容',
  `img_urls` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '评论图片',
  `date_created` datetime NOT NULL COMMENT '评论创建时间',
  `is_deleted` int NOT NULL DEFAULT '0' COMMENT '1删除0未删除',
  `status` int DEFAULT '1' COMMENT '1待审核2审核成功3审核失败',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1758399957185900546 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='问题评论表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comments`
--

LOCK TABLES `comments` WRITE;
/*!40000 ALTER TABLE `comments` DISABLE KEYS */;
INSERT INTO `comments` VALUES (1733112385750822913,1738574834838913047,1,'评论1','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/JYU14tnbfOA.jpg\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/DUPFowqI6oI.jpg\"]','2023-12-08 21:12:47',0,2),(1737791018523045890,1738574834838913047,1,'评论1','[\"article/JYU14tnbfOA.jpg\",\"article/DUPFowqI6oI.jpg\"]','2023-12-21 19:04:00',0,2),(1738573380661133314,1738574834838913047,1,'评论1','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/JYU14tnbfOA.jpg\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/article/DUPFowqI6oI.jpg\"]','2023-12-23 22:52:50',0,2),(1741846532967153665,1741743850969411586,5,'干活','[]','2024-01-01 23:39:10',0,2),(1742101565494198273,1741743850969411586,1742101348787093505,'不好吃','[]','2024-01-02 16:32:35',0,2),(1742101645391495170,1741743850969411586,1742101348787093505,'666','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/101415458N789FBqimc2wTyZemodhR2Z.png\"]','2024-01-02 16:32:54',0,2),(1742178464442556418,1742104116629274625,1741866144495497217,'哈哈哈','[]','2024-01-02 21:38:09',0,2),(1742178580872241154,1742104116629274625,1741866144495497217,'刚刚','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/75212149leI2JgxZaY2YOBS49ivNaKse.jpg\"]','2024-01-02 21:38:36',0,2),(1745815205112090625,1742104116629274625,1745814552339976194,'侧视','[]','2024-01-12 22:29:15',0,2),(1746469279184621569,1742104116629274625,1742169110809092099,'1231','[]','2024-01-14 17:48:19',0,2),(1747236318273896450,1742104116629274625,1742169110809092099,'sd','[]','2024-01-16 20:36:15',0,2),(1754465005986537473,1754460311159463938,1742169110809092099,'djdjj🪆🐮😂🪟🪟🐔🪟🪟🐔⛄️','[]','2024-02-05 19:20:28',0,2),(1755317461133991938,1754460311159463938,1742169110809092099,'哈哈哈','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/d8fc9517-4f70-4ec9-8aab-9d9096ae8227.jpg\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/21f69af5-7d16-4d81-ad48-2bdc54a39155.jpg\"]','2024-02-08 03:47:50',0,2),(1755559736564105217,1754460311159463938,1742169110809092099,'12','[]','2024-02-08 19:50:33',0,3),(1755567725190627329,1754460311159463938,1742169110809092099,'sd','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/2959451c-ab8c-4da6-b03f-a2a020a4cbda.png\"]','2024-02-08 20:22:17',0,2),(1755959585436368897,1755954979088138241,1742169110809092099,'12','[]','2024-02-09 22:19:24',0,2),(1755959766563192833,1755954979088138241,1742169110809092099,'12','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/42b35cb8-92a4-4c95-8491-7e465233cbe0.png\"]','2024-02-09 22:20:07',0,2),(1757297233874714625,-1,1742169110809092099,'12321321','[]','2024-02-13 14:54:44',0,2),(1757297573386846209,-1,1742169110809092099,'21321321','[]','2024-02-13 14:56:05',0,1),(1758399957185900545,1756907722679177217,1742169110809092099,'21321','[]','2024-02-16 15:56:34',0,2);
/*!40000 ALTER TABLE `comments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enterprise_hires`
--

DROP TABLE IF EXISTS `enterprise_hires`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enterprise_hires` (
  `id` bigint NOT NULL DEFAULT '1',
  `user_id` bigint NOT NULL DEFAULT '0' COMMENT '发布的用户',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '标题',
  `enterprise_information_id` bigint NOT NULL COMMENT '企业信息id',
  `work` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作岗位',
  `salary` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '薪水：6000-8000元/月',
  `recruits_number` int NOT NULL COMMENT '招聘人数',
  `contact_person` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系人',
  `contact_information` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系方式',
  `work_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作地址',
  `publish_time` datetime NOT NULL COMMENT '发布时间',
  `deadline` datetime NOT NULL COMMENT '截止招聘时间',
  `job_details` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作详情',
  `status` int NOT NULL COMMENT '状态：1、待审核2、审核成功，展示中3、审核失败，已打回4、到达截止时间，已下架',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='企业招聘信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enterprise_hires`
--

LOCK TABLES `enterprise_hires` WRITE;
/*!40000 ALTER TABLE `enterprise_hires` DISABLE KEYS */;
INSERT INTO `enterprise_hires` VALUES (1,1,'1广西万凯新材料科技有限公司',1731881592042909697,'设计师','6000~8000 元/月',2,'谭女士','18912312300','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2024-12-31 08:00:00','岗位详情',2),(1731921368225705986,1,'1广西万凯新材料科技有限公司',1731881592042909697,'设计师','4000~8000 元/月',2,'谭女士','18912312300','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2024-12-31 08:00:00','<p>设计师2名<br>1.土木工程或结构工程、工民建专业<br>2.有1-3年工作经验，年龄25-45岁，本科学历；<br>3.熟悉CAD操作，识图会使用画图工具；<br>4.有中级职称，优秀毕业生者可放宽条件；<br>岗位职责：<br>1.对内工程技术交付；<br>2.对外工程技术交付；<br>3.协助构建生产线筹建；<br>4.构建产品试制样品</p><p>6K~8K,<br>公司提供住宿，有员工饭堂，买五险，节假日福利</p>',2),(1758400719047667713,1742169110809092099,'1',1755577231131832321,'1','1',1,'1','1','1','2024-02-16 15:59:36','2024-02-16 15:59:32','1',4);
/*!40000 ALTER TABLE `enterprise_hires` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enterprise_information`
--

DROP TABLE IF EXISTS `enterprise_information`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enterprise_information` (
  `id` bigint NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '企业名称',
  `credit_code` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '信用代码',
  `established_time` date NOT NULL COMMENT '成立时间',
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '地址',
  `business_license_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '营业执照url',
  `authorization_letter_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '授权书url',
  `photo_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '企业照片url',
  `user_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='企业信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enterprise_information`
--

LOCK TABLES `enterprise_information` WRITE;
/*!40000 ALTER TABLE `enterprise_information` DISABLE KEYS */;
INSERT INTO `enterprise_information` VALUES (1731881592042909697,'1广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',1),(1731882706867884034,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',1),(1731883097454055425,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',2),(1731916048795561986,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',2),(1731916264437313537,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',3),(1731917812806492161,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',2),(1731918616338669569,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',4),(1731919380847079426,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2023-10-26','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',4),(1731921367911133185,'广西万凯新材料科技有限公司','91450800MA5P87B36E','2019-12-18','广东省清远市清城区东城街道中宿路36号','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s372s0.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/v2_s37wt5.jpg','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/zr0bu27etm.jpg',3),(1747570770284879874,'1','1','2024-01-09','1','http://tmp/qAoNfiRi5os7a07d3ae607b54da51a5cad8ac63bce35.png','http://tmp/Y0XsbZthEqWOa07d3ae607b54da51a5cad8ac63bce35.png','http://tmp/Bq0O7tq5F1LVa07d3ae607b54da51a5cad8ac63bce35.png',1747557704277139458),(1755577231131832321,'1','1','2024-02-08','1','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/d860e199-aa99-4a2e-9c7d-9e6af90d45a9.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/d270edd0-7279-48ec-945a-fed420eb042b.png','https://villageestation.oss-cn-guangzhou.aliyuncs.com/job/773837d6-08e8-4ce8-aed5-ed80cd768fe3.png',1742169110809092099);
/*!40000 ALTER TABLE `enterprise_information` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gig_hires`
--

DROP TABLE IF EXISTS `gig_hires`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gig_hires` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` bigint NOT NULL COMMENT '用户id',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '标题',
  `work` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作岗位',
  `recruits_number` int NOT NULL COMMENT '招聘人数',
  `salary` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '薪酬',
  `contact_person` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系人',
  `contact_information` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系方式，手机邮箱',
  `work_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作地',
  `start_time` datetime NOT NULL COMMENT '工作开始时间',
  `end_time` datetime NOT NULL COMMENT '工作结束时间',
  `publish_time` datetime NOT NULL COMMENT '招聘发布时间',
  `deadline` datetime NOT NULL COMMENT '招聘截止（下架）时间',
  `job_details` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作详情',
  `status` int NOT NULL COMMENT '状态：1、待审核2、审核成功，展示中3、审核失败，已打回4、到达截止时间，已下架',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1758405396682293251 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='零工招聘信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gig_hires`
--

LOCK TABLES `gig_hires` WRITE;
/*!40000 ALTER TABLE `gig_hires` DISABLE KEYS */;
INSERT INTO `gig_hires` VALUES (44613515157,1,'装修设计121','装修设计',2,'25 元/小时','谭女士','18912312300','广东省清远市清城区东城街道中宿路36号','2024-12-31 08:00:00','2023-12-31 08:00:00','2023-10-26 08:00:00','2023-12-31 08:00:00','<p>1.土木工程或结构工程、工民建专业<br>2.有1-3年工作经验，年龄25-45岁，本科学历；<br>3.熟悉CAD操作，识图会使用画图工具；<br>4.有中级职称，优秀毕业生者可放宽条件；<br>岗位职责：<br>1.对内工程技术交付；<br>2.对外工程技术交付；<br>3.协助构建生产线筹建；<br>4.构建产品试制样品</p>',4),(44613515159,1,'装修设计','装修设计',2,'25 元/小时','谭女士','18912312300','广东省清远市清城区东城街道中宿路36号','2024-12-31 08:00:00','2023-12-31 08:00:00','2023-10-26 08:00:00','2023-12-31 08:00:00','<p>1.土木工程或结构工程、工民建专业<br>2.有1-3年工作经验，年龄25-45岁，本科学历；<br>3.熟悉CAD操作，识图会使用画图工具；<br>4.有中级职称，优秀毕业生者可放宽条件；<br>岗位职责：<br>1.对内工程技术交付；<br>2.对外工程技术交付；<br>3.协助构建生产线筹建；<br>4.构建产品试制样品</p>',4),(1754463064564850690,1742169110809092099,'sadsa😊❤️💕🤦‍♂️🤷‍♂️🤷‍♂️🤷‍♀️😁🎃🎇🎃🎃','sadsa😊❤️💕🤦‍♂️🤷‍♂️🤷‍♂️🤷‍♀️😁🎃🎇🎃🎃',1,'sad','asd','asd','asd','2024-02-05 19:02:31','2024-02-05 19:02:33','2024-02-05 19:12:46','2024-02-05 19:02:31','asd',4),(1755315114899054593,1742169110809092099,'躺一会','躺一会',1222,'122','hjj','vhjjj','刚回家','2024-02-08 03:38:09','2024-02-08 03:38:10','2024-02-08 03:38:30','2024-02-08 03:38:09','yjhbb',4),(1755552236003508226,1742169110809092099,'1','1',1,'1','1','1','1','2024-02-08 19:20:39','2024-02-08 19:20:40','2024-02-08 19:20:44','2024-02-08 19:20:39','1',4),(1756688910972387330,1742169110809092099,'1','1',1,'1','1','1','1','2024-02-11 22:37:23','2024-02-11 22:37:25','2024-02-11 22:37:29','2024-02-11 22:37:23','111',3),(1758400974262677505,1755843332621242369,'回家','回家',123,'设计师','仙湖度假区','都好好的家','上你家睡觉','2024-02-16 16:00:22','2024-02-16 16:00:25','2024-02-16 16:00:36','2024-02-16 16:00:22','抱着手机吧',4),(1758405396682293250,1755843332621242369,'规划好','规划好',55,'打扮打扮','黑道皇后','一喝酒','然后电话','2024-02-16 16:18:02','2024-02-16 16:18:04','2024-02-16 16:18:11','2024-02-16 16:18:02','神经',4);
/*!40000 ALTER TABLE `gig_hires` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gig_job_hunting`
--

DROP TABLE IF EXISTS `gig_job_hunting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gig_job_hunting` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` bigint NOT NULL COMMENT '用户id',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '标题',
  `expected_work` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '期望工作',
  `expected_salary` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '期望薪酬',
  `contact_person` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '求职者',
  `contact_information` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系方式，手机或邮箱',
  `work_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作地址',
  `start_time` datetime NOT NULL COMMENT '工作开始时间',
  `end_time` datetime NOT NULL COMMENT '工作结束时间',
  `publish_time` datetime NOT NULL COMMENT '招聘发布时间',
  `deadline` datetime NOT NULL COMMENT '招聘下架时间',
  `status` int NOT NULL COMMENT '状态：1、待审核2、审核成功，展示中3、审核失败，已打回4、到达截止时间，已下架',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1758400044167376898 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='零工求职信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gig_job_hunting`
--

LOCK TABLES `gig_job_hunting` WRITE;
/*!40000 ALTER TABLE `gig_job_hunting` DISABLE KEYS */;
INSERT INTO `gig_job_hunting` VALUES (6,1,'仓管、品保员','仓管、品保员','25.00','黄先生','18912312311','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2023-10-30 08:00:00','2023-10-26 08:00:00','2024-10-30 08:00:00',2),(7,1,'仓管、品保员','仓管、品保员','25 元/小时','黄先生','18912312311','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2023-10-26 08:00:00','2023-10-26 08:00:00','2024-12-31 08:00:00',2),(1737817914640052226,1,'仓管、品保员','仓管、品保员','25 元/小时','黄先生','18912312311','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2023-10-26 08:00:00','2023-10-26 08:00:00','2024-12-31 08:00:00',3),(1738548508820021249,1,'仓管、品保员','仓管、品保员','25 元/小时','黄先生','18912312311','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2023-10-26 08:00:00','2023-10-26 08:00:00','2024-12-31 08:00:00',2),(1738575057803919362,1,'仓管、品保员','仓管、品保员','25 元/小时','黄先生','18912312311','广东省清远市清城区东城街道中宿路36号','2023-10-26 08:00:00','2023-10-26 08:00:00','2023-10-26 08:00:00','2023-12-31 08:00:00',4),(1755957853738270722,1742169110809092099,'1','1','1','1','1','1','2024-02-09 22:11:55','2024-02-09 22:11:56','2024-02-09 22:12:31','2024-02-09 22:11:55',4),(1755957983082217474,1742169110809092099,'1','1','1','1','1','1','2024-02-09 22:12:57','2024-02-09 22:12:58','2024-02-09 22:13:02','2024-02-09 22:12:57',4),(1758400044167376897,1742169110809092099,'1','1','1','1','1','1','2024-02-16 15:56:51','2024-02-27 15:56:52','2024-02-16 15:56:55','2024-02-16 15:56:51',4);
/*!40000 ALTER TABLE `gig_job_hunting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods`
--

DROP TABLE IF EXISTS `goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '商品名称',
  `price` decimal(10,2) NOT NULL COMMENT '商品价格',
  `postage` int NOT NULL COMMENT '邮费',
  `code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '商品码',
  `thumbnail_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '略缩图url',
  `rotation_urls` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '轮播图urls',
  `description` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '描述信息',
  `is_deleted` int NOT NULL DEFAULT '0' COMMENT '是否删除',
  `category_id` int NOT NULL COMMENT '分类id',
  `status` int NOT NULL DEFAULT '1' COMMENT '销售状态 1、在售 2、下架 3、库存不足',
  `stock` int NOT NULL COMMENT '总货存',
  `surplus` int NOT NULL COMMENT '剩余库存',
  `recent_sales` int NOT NULL DEFAULT '0' COMMENT '近30天销量',
  `sales_quantity` int NOT NULL DEFAULT '0' COMMENT '销售总量',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1762028832168148994 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='商品信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods`
--

LOCK TABLES `goods` WRITE;
/*!40000 ALTER TABLE `goods` DISABLE KEYS */;
INSERT INTO `goods` VALUES (1397849213576890114,'苹果',10580755.00,2756,'2222222222222','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/75267754CNm9licS7Oz6kf5kWYlT9oJ8.png','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/75267754CNm9licS7Oz6kf5kWYlT9oJ8.png\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/4b18e57f-d177-4f90-b162-054b59d45c65.jpg\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/97f119a5-37cd-4e29-bdb7-74462388add5.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/d96d0a84-b759-40d0-a226-e9efeddd629d.png\" data-local=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/d96d0a84-b759-40d0-a226-e9efeddd629d.png\"></p><p><br></p><p>12</p>',0,1,1,9998,9998,401,401),(1397849739275151010,'西瓜',8.99,0,'5678901234567','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','清爽解渴的西瓜',0,1,1,100,89,11,11),(1397849739275151011,'草莓',10.99,0,'6789012345678','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','甜美多汁的草莓',0,1,1,100,100,0,0),(1397849739275151012,'柠檬',7.99,0,'7890123456789','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','酸爽可口的柠檬',0,1,1,100,100,0,0),(1397849739275151015,'柚子',11.99,0,'0123456789012','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','酸甜可口的柚子',0,1,1,100,100,0,0),(1397849739275151016,'蓝莓',13.99,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','富含抗氧化剂的蓝莓',0,1,1,100,100,0,0),(1397849739275151017,'石榴',14.99,0,'4567890123456','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','多汁美味的石榴',0,1,1,100,100,0,0),(1397849739275151018,'桃子',15.99,0,'5678901234567','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的桃子',0,1,1,100,100,0,0),(1397849739275151022,'木瓜',19.99,0,'9012345678901','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的木瓜',0,1,1,100,100,0,0),(1397849739275151024,'榴莲',21.99,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香气四溢的榴莲',0,1,1,100,100,0,0),(1397849739275151025,'桃子干',5.99,0,'4567890123456','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的桃子干',0,3,1,100,100,0,0),(1397849739275151026,'啤酒',6.49,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','爽口的啤酒，庆祝胜利',0,3,1,100,99,1,31),(1397849739275151047,'薯片',7.99,0,'2345678901234','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香脆可口的薯片',0,3,1,100,100,0,0),(1397849739275151048,'饼干',5.99,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','酥脆的饼干，适合下午茶',0,3,1,100,100,0,0),(1397849739275151049,'牛奶',3.99,0,'4567890123456','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','营养丰富的牛奶，保持健康',0,3,1,100,100,0,0),(1397849739275151051,'可乐',4.99,0,'6789012345678','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','清爽的可乐，消暑解渴',0,3,1,100,100,0,0),(1397849739275151052,'矿泉水',2.99,0,'7890123456789','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','纯净的水，保持身体水分平衡',0,3,1,100,100,0,0),(1397849739275151054,'茶叶',3.49,0,'9012345678901','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','清香的茶叶，放松身心',0,3,1,100,100,0,0),(1397849739275151055,'红酒',15.99,0,'0123456789012','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','优雅的红酒，品味生活',0,3,1,100,100,0,0),(1397849739275151096,'大米A',5.60,1,'1234567890123','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\",\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米A的描述',0,2,1,1045,100,0,0),(1397849739275151097,'大米B23',15.99,0,'2345678901234','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p>这是大米B的描述</p>',0,2,1,100,100,0,0),(1397849739275151098,'油A',20.99,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是油A的描述',0,2,1,100,100,0,0),(1397849739275151099,'油B',25.99,0,'4567890123456','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是油B的描述',0,2,1,100,100,0,0),(1397849739275151100,'大米C',30.99,0,'5678901234567','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米C的描述',0,2,1,100,100,0,0),(1397849739275151101,'大米D',35.99,0,'6789012345678','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米D的描述',0,2,1,100,100,0,0),(1397849739275151102,'油C',40.99,0,'7890123456789','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是油C的描述',0,2,1,100,100,0,0),(1397849739275151103,'油D',45.99,0,'8901234567890','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是油D的描述',0,2,1,100,100,0,0),(1397849739275151104,'大米E',50.99,0,'9012345678901','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米E的描述',0,2,1,100,100,0,0),(1397849739275151105,'大米F',55.99,0,'0123456789012','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米F的描述',0,2,1,100,100,0,0),(1397849739275151106,'油E',60.99,0,'3456789012345','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是油E的描述',0,2,1,100,100,0,0),(1397849739275152096,'鸡蛋',3.99,0,'1234567890123','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是一个新鲜的鸡蛋',0,4,1,100,100,0,0),(1397849739275152097,'鸭蛋',5.99,0,'2345678901234','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是一个美味的鸭蛋',0,4,1,100,100,0,0),(1397849739275152141,'test2',12.00,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','描述',0,1,1,1,1,1,1),(1740993121262505987,'苹果',10.00,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\" alt=\"\" width=\"370px\"></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\" alt=\"\" width=\"370px\"></p>',0,1,1,100,100,0,0),(1740993121262505988,'梨子',12.00,1,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\" alt=\"\" width=\"370px\"></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\" alt=\"\" width=\"370px\"></p>',0,1,1,100,100,0,0),(1740993121262505989,'蓝莓',13.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','富含抗氧化剂的蓝莓',0,1,1,100,100,0,0),(1740993121262505990,'桃子',15.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的桃子',0,1,1,100,100,0,0),(1740993121262505991,'橙子',4.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\" alt=\"\" width=\"370px\"></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\" alt=\"\" width=\"370px\"></p>',0,1,1,100,100,0,0),(1740993121262505992,'香蕉',3.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\" alt=\"\" width=\"370px\"></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\" alt=\"\" width=\"370px\"></p>',0,1,1,100,100,0,0),(1740993121262505993,'石榴',14.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','多汁美味的石榴',0,1,1,100,100,0,0),(1740993121262505994,'柚子',11.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','酸甜可口的柚子',0,1,1,100,100,0,0),(1740993121262505995,'火龙果',18.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','营养丰富的火龙果',0,1,1,100,100,0,0),(1740993121262505996,'木瓜',19.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的木瓜',0,1,1,100,100,0,0),(1740993121262505997,'樱桃',12.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','鲜嫩多汁的樱桃',0,1,1,100,100,0,0),(1740993121262505998,'猕猴桃',9.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','口感细腻的猕猴桃',0,1,1,100,100,0,0),(1740993121262505999,'啤酒',6.49,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','爽口的啤酒，庆祝胜利',0,3,1,100,100,0,0),(1740993121262506000,'桃子干',5.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','香甜可口的桃子干',0,3,1,100,100,0,0),(1740993121262506001,'牛奶',3.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','营养丰富的牛奶，保持健康',0,3,1,100,100,0,0),(1740993121262506003,'大米D',35.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米D的描述',0,2,1,100,100,0,0),(1740993121262506004,'苹果',10.00,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','<p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\" alt=\"\" width=\"370px\"></p><p><img src=\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\" alt=\"\" width=\"370px\"></p>',0,1,1,100,100,0,0),(1740993121262506005,'大米E',50.99,0,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg\", \"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg\"]','这是大米E的描述',0,2,1,100,100,0,0),(1754445364353622017,'1',1.00,1,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/4e8a6024-dc3d-4ebf-84ce-71d7335367d2.png','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/4e8a6024-dc3d-4ebf-84ce-71d7335367d2.png\"]','<p><br></p><p>1<img src=\"http://tmp/y1csI5ile5fG91631686e0bf1a73fc40ae522957b6c2.png\"></p><p><br></p><p><br></p>',0,1,1,1,1,1,1),(1755554290759483394,'1',1.00,1,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/9ec75b17-ad5a-4ede-81c6-0b0827eadcc1.png','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/9ec75b17-ad5a-4ede-81c6-0b0827eadcc1.png\"]','<p>11</p>',0,1,1,1,1,1,1),(1762028832168148993,'1',1.00,1,NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/cf16e3f1-be53-425d-abb8-2116d4a967de.png','[\"https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/cf16e3f1-be53-425d-abb8-2116d4a967de.png\"]','<p>12</p>',0,1,1,1,1,1,1);
/*!40000 ALTER TABLE `goods` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods_category`
--

DROP TABLE IF EXISTS `goods_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods_category` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '分类名称',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1747233786776551431 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='商品分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods_category`
--

LOCK TABLES `goods_category` WRITE;
/*!40000 ALTER TABLE `goods_category` DISABLE KEYS */;
INSERT INTO `goods_category` VALUES (1,'水果蔬菜'),(2,'油粮米面'),(3,'休闲零食'),(4,'禽畜肉蛋');
/*!40000 ALTER TABLE `goods_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_detail`
--

DROP TABLE IF EXISTS `order_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_detail` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '商品名称',
  `thumbnail_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '略缩图url',
  `price` decimal(10,2) NOT NULL COMMENT '商品价格',
  `code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '商品码',
  `quantity` int NOT NULL DEFAULT '1' COMMENT '该商品的数量',
  `order_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '订单号',
  `good_id` bigint NOT NULL COMMENT '商品id',
  `status` int NOT NULL DEFAULT '1' COMMENT '商品状态：1、未退款2、退款中3、已退款',
  `user_id` bigint DEFAULT NULL COMMENT '用户id',
  `refund_no` bigint DEFAULT NULL COMMENT '退款单号',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1758453728490356739 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='订单明细表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_detail`
--

LOCK TABLES `order_detail` WRITE;
/*!40000 ALTER TABLE `order_detail` DISABLE KEYS */;
INSERT INTO `order_detail` VALUES (1616515648,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1738901080685244416',1397849739275151013,1,NULL,0),(1616515649,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',3.99,'2345678901234',1,'1738901080685244416',1397849739275151007,1,NULL,0),(1616515650,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1738902118108590080',1397849739275151013,1,NULL,0),(1616515651,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',3.99,'2345678901234',1,'1738902118108590080',1397849739275151007,1,NULL,0),(1616515652,'菠萝','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',16.99,'6789012345678',1,'1739172749896269824',1397849739275151019,1,NULL,0),(1616515653,'柚子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',11.99,'0123456789012',1,'1739172749896269824',1397849739275151015,1,NULL,0),(1616515654,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',10.00,'2222222222222',1,'1739173463724867584',1397849213576890114,1,NULL,0),(1616515655,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',10.00,'2222222222222',1,'1739173622059843584',1397849213576890114,1,NULL,0),(1616515656,'柚子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',11.99,'0123456789012',1,'1739173755149303808',1397849739275151015,1,NULL,0),(1616515657,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1739173755149303808',1397849739275151013,1,NULL,0),(1616515658,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1739174376103428096',1397849739275151013,1,NULL,0),(1616515662,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1739174851364208640',1397849739275151013,1,NULL,0),(1616515663,'柚子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',11.99,'0123456789012',1,'1739174851364208640',1397849739275151015,1,NULL,0),(1616515664,'菠萝','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',16.99,'6789012345678',1,'1739174851364208640',1397849739275151019,1,NULL,0),(1616515700,'樱桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.99,'8901234567890',1,'1741718406111490048',1397849739275151013,1,NULL,0),(1616515701,'梨子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.00,'1111111111111',1,'1741741911435702272',1397849739275151001,1,NULL,0),(1616515711,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,'1741750456449327104',1397849739275151007,1,NULL,0),(1616515712,'酸奶','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',4.99,'6789012345678',1,'1742055929382871040',1397849739275151027,1,NULL,0),(1616515713,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',1,'1742083952953958400',1397849213576890114,1,NULL,0),(1616515714,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',1,'1742084053768249344',1397849213576890114,1,NULL,0),(1616515715,'荔枝','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',20.99,'0123456789012',1,'1742088094497808384',1397849739275151023,1,NULL,0),(1616515716,'猕猴桃','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',9.99,'9012345678901',1,'1742098163289464832',1397849739275151014,1,NULL,0),(1616515718,'桃子干','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',5.99,'4567890123456',1,'1742102173836812288',1397849739275151025,1,NULL,0),(1616515719,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',1,'1742102173836812288',1397849213576890114,1,NULL,0),(1616515721,'啤酒','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.49,'3456789012345',1,'1742107068855451648',1397849739275151026,1,NULL,0),(1616515722,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742107532242157568',1397849739275151040,1,NULL,0),(1616515723,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742107948195479552',1397849739275151040,1,NULL,0),(1616515724,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742108649529245696',1397849739275151040,1,NULL,0),(1616515725,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742108871827312640',1397849739275151040,1,NULL,0),(1616515726,'饼干','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',5.99,'3456789012345',1,'1742109197429547008',1397849739275151048,1,NULL,0),(1616515727,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742109173318107136',1397849739275151040,1,NULL,0),(1616515728,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',1,'1742109537324969984',1397849739275151040,1,NULL,0),(1616515729,'牛奶','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',3.99,'4567890123456',1,'1742110067529523200',1397849739275151049,1,NULL,0),(1616515730,'可乐','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',4.99,'6789012345678',1,'1742110698906492928',1397849739275151051,1,NULL,0),(1616515731,'矿泉水','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',2.99,'7890123456789',1,'1742110698906492928',1397849739275151052,1,NULL,0),(1742110702027436034,'果汁','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'5678901234567',2,'1742110670621704192',1397849739275151040,1,NULL,0),(1742110702027436035,'咖啡','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',7.99,'8901234567890',1,'1742110852648706048',1397849739275151053,3,NULL,0),(1742147129711759362,'梨子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',12.00,'1111111111111',1,'1742147129641267200',1397849739275151001,1,NULL,0),(1742149885025525762,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',10,'1742149884950790144',1397849213576890114,1,NULL,0),(1748215814682607617,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',60,'1748215814265868288',1397849213576890114,1,NULL,0),(1748216272021127169,'苹果','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',10.00,'2222222222222',60,'1748216271726022656',1397849213576890114,1,NULL,0),(1748580659068239874,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,'1748580658315825152',1397849739275151007,1,NULL,0),(1748580659068239875,'橙子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',4.99,'3456789012345',2,'1748580658315825152',1397849739275151008,1,NULL,0),(1748580659068239876,'葡萄','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',6.99,'4567890123456',1,'1748580658315825152',1397849739275151009,1,NULL,0),(1752610960531410946,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,'1752610960310005760',1397849739275151007,3,NULL,NULL),(1752610960531410947,'橙子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',4.99,'3456789012345',2,'1752610960310005760',1397849739275151008,1,NULL,NULL),(1752611067842678786,'梨子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rr.jpg',12.00,'1111111111111',1,'1752611067759685632',1397849739275151001,1,NULL,NULL),(1758445101603946498,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,'1758445101195464704',1397849739275151010,3,NULL,NULL),(1758448389887950850,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,'1758448389571743744',1397849739275151010,1,NULL,NULL),(1758453377481637890,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,'1758453377182208000',1397849739275151010,1,NULL,NULL),(1758453728490356738,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,'1758453728178343936',1397849739275151010,1,NULL,NULL);
/*!40000 ALTER TABLE `order_detail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `order_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '订单号',
  `receive_information` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '收货信息：张x,139xx,广东省xx',
  `order_status` int NOT NULL DEFAULT '1' COMMENT '订单状态 1待付款、2待发货、3待收货、4已完成、5已关闭',
  `postage` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '运费',
  `discount_amount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '优惠金额',
  `total_amount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '总金额',
  `actual_amount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '实际价格',
  `track_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '物流单号',
  `order_time` datetime NOT NULL COMMENT '下单时间',
  `pay_time` datetime DEFAULT NULL COMMENT '付款时间',
  `send_time` datetime DEFAULT NULL COMMENT '发货时间',
  `receive_time` datetime DEFAULT NULL COMMENT '收货时间',
  `user_id` bigint NOT NULL COMMENT '用户id',
  `expire_time` datetime DEFAULT NULL COMMENT '到期时间（未付款时使用）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1758453728360333314 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='订单表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (1738901080818954242,'1738901080685244416','张三,135123456781,广东省清远市清城区中宿路36号',1,0.00,0.00,16.98,16.98,NULL,'2023-12-24 20:35:00',NULL,NULL,NULL,1,NULL),(1739174851432632322,'1739174851364208640','张三,135123456781,广东省清远市清城区中宿路36号',3,0.00,0.00,41.97,41.97,'errertre','2023-12-25 14:42:52','2023-12-21 08:53:51','2023-12-24 20:35:00',NULL,1,NULL),(1741718406316470274,'1741718406111490048','小李,13512345678,广东省清远市清城区中宿路36号5',1,0.00,0.00,12.99,12.99,NULL,'2024-01-01 15:10:02',NULL,NULL,NULL,1,NULL),(1741741911590350849,'1741741911435702272','小李,13512345678,广东省清远市清城区中宿路36号5',1,0.00,0.00,12.00,12.00,NULL,'2024-01-01 16:43:26',NULL,NULL,NULL,1,NULL),(1741750456645918722,'1741750456449327104','张abc,1818181818,广东省清远市清城区中宿路36号',1,0.00,0.00,3.99,3.99,NULL,'2024-01-01 17:17:24',NULL,NULL,NULL,2,NULL),(1742055929457606658,'1742055929382871040','张abc,1818181818,广东省清远市清城区中宿路36号',1,0.00,0.00,4.99,4.99,NULL,'2024-01-02 13:31:14',NULL,NULL,NULL,2,NULL),(1742083952995139585,'1742083952953958400','张abc,1818181818,广东省清远市清城区中宿路36号',1,0.00,0.00,10.00,10.00,NULL,'2024-01-02 15:22:35',NULL,NULL,NULL,2,NULL),(1742084053809430530,'1742084053768249344','张abc,1818181818,广东省清远市清城区中宿路36号',1,0.00,0.00,10.00,10.00,NULL,'2024-01-02 15:22:59',NULL,NULL,NULL,2,NULL),(1742088094538989570,'1742088094497808384','张abc,1818181818,广东省清远市清城区中宿路36号',1,0.00,0.00,20.99,20.99,NULL,'2024-01-02 15:39:03',NULL,NULL,NULL,2,NULL),(1742098163326451714,'1742098163289464832','张三,13512345678,广东省清远市清城区中宿路36号',1,0.00,0.00,9.99,9.99,NULL,'2024-01-02 16:19:03',NULL,NULL,NULL,1,NULL),(1742102173915742209,'1742102173836812288','12,123123,广东省深圳市罗湖区',3,0.00,0.00,15.99,15.99,'1742148846797635584','2024-01-02 16:35:00',NULL,NULL,NULL,1742101348787093505,NULL),(1742107069189722114,'1742107068855451648','哈哈哈,姐姐好,广东省深圳市罗湖区回家',5,0.00,0.00,6.49,6.49,NULL,'2024-01-02 16:54:27',NULL,NULL,NULL,1741866144495497217,NULL),(1742107532492541954,'1742107532242157568','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,6.99,6.99,NULL,'2024-01-02 16:56:17',NULL,NULL,NULL,1741866144495497217,NULL),(1742108091165446146,'1742107948195479552','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,6.99,6.99,NULL,'2024-01-02 16:58:28',NULL,NULL,NULL,1741866144495497217,NULL),(1742108800044765186,'1742108649529245696','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,6.99,6.99,NULL,'2024-01-02 17:01:19',NULL,NULL,NULL,1741866144495497217,NULL),(1742109101460119553,'1742108871827312640','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,6.99,6.99,NULL,'2024-01-02 17:02:31',NULL,NULL,NULL,1741866144495497217,NULL),(1742109197466533890,'1742109197429547008','abc,17817281475,广东省深圳市罗湖区撒大汉奸是快递哈卡斯',1,0.00,0.00,5.99,5.99,NULL,'2024-01-02 17:02:54',NULL,NULL,NULL,2,NULL),(1742109202454794241,'1742109173318107136','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,6.99,6.99,NULL,'2024-01-02 17:02:55',NULL,NULL,NULL,1741866144495497217,NULL),(1742109537650982914,'1742109537324969984','哈哈哈,姐姐好,广东省深圳市罗湖区回家',1,0.00,0.00,13.98,13.98,NULL,'2024-01-02 17:04:15',NULL,NULL,NULL,1741866144495497217,NULL),(1742110067570704386,'1742110067529523200','abc,17817281475,广东省深圳市罗湖区撒大汉奸是快递哈卡斯',4,0.00,0.00,3.99,3.99,NULL,'2024-01-02 17:06:22',NULL,NULL,NULL,2,NULL),(1742110670880534530,'1742110670621704192','哈哈哈,姐姐好,广东省深圳市罗湖区回家',4,0.00,0.00,13.98,13.98,NULL,'2024-01-02 17:08:45',NULL,NULL,NULL,1741866144495497217,NULL),(1742110698985422850,'1742110698906492928','。,1,广东省深圳市罗湖区。',3,0.00,0.00,7.98,7.98,'7','2024-01-02 17:08:52',NULL,NULL,NULL,1742110156498337793,NULL),(1742110852689887233,'1742110852648706048','。,1,广东省深圳市罗湖区。',4,0.00,0.00,7.99,7.99,NULL,'2024-01-02 17:09:29',NULL,NULL,NULL,1742110156498337793,NULL),(1742147129682399233,'1742147129641267200','张三,13512345678,广东省清远市清城区中宿路36号',4,0.00,0.00,12.00,12.00,NULL,'2024-01-02 19:33:38',NULL,NULL,NULL,1,NULL),(1742149884996165633,'1742149884950790144','1,1,浙江省温州市鹿城区31',1,0.00,0.00,100.00,100.00,NULL,'2024-01-02 19:44:35',NULL,NULL,NULL,2,NULL),(1748215814498058241,'1748216742880579584','1,1,广东省广州市天河区1',1,0.00,0.00,600.00,600.00,NULL,'2024-01-19 13:28:25',NULL,NULL,NULL,1742169110809092099,NULL),(1748216271891103745,'1748216577138462720','1,1,广东省广州市天河区1',1,0.00,0.00,600.00,600.00,NULL,'2024-01-19 13:30:14',NULL,NULL,NULL,1742169110809092099,NULL),(1748580658934022146,'1748580658315825152','1,1,广东省广州市天河区1',3,0.00,0.00,24.95,24.95,'','2024-01-20 13:38:11',NULL,NULL,NULL,1742169110809092099,NULL),(1752610960472690690,'1752610960310005760','1,1,广东省广州市天河区1',3,0.00,0.00,17.96,17.96,'11111111111111111111','2024-01-31 16:33:10',NULL,NULL,NULL,1742169110809092099,NULL),(1752611067809124354,'1752611067759685632','1,1,广东省广州市天河区1',4,0.00,0.00,12.00,12.00,NULL,'2024-01-31 16:33:35',NULL,NULL,NULL,1742169110809092098,NULL),(1758445101469728769,'1758445101195464704','12,12,广东省广州市荔湾区121231',5,0.00,0.00,8.99,8.99,NULL,'2024-02-16 18:55:57',NULL,NULL,NULL,1755843332621242369,'2024-02-16 19:10:57'),(1758448389757927425,'1758448389571743744','12,12,广东省广州市荔湾区121231',3,0.00,0.00,8.99,8.99,'','2024-02-16 19:09:01',NULL,NULL,NULL,1755843332621242369,'2024-02-16 19:24:01'),(1758453377351614465,'1758453377182208000','12,12,广东省广州市荔湾区121231',5,0.00,0.00,8.99,8.99,NULL,'2024-02-16 19:28:50',NULL,NULL,NULL,1755843332621242369,'2024-02-16 19:43:50'),(1758453728360333313,'1758453728178343936','12,12,广东省广州市荔湾区121231',3,0.00,0.00,8.99,8.99,'123','2024-02-16 19:30:14',NULL,'2024-02-16 19:32:53',NULL,1755843332621242369,'2024-02-16 19:45:14');
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `privacy_protocol`
--

DROP TABLE IF EXISTS `privacy_protocol`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `privacy_protocol` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `privacy` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='隐私政策表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `privacy_protocol`
--

LOCK TABLES `privacy_protocol` WRITE;
/*!40000 ALTER TABLE `privacy_protocol` DISABLE KEYS */;
INSERT INTO `privacy_protocol` VALUES (1,'<p>保护用户隐私是一项基本政策，[本小程序]保证不对外公开或向第三方提供您的注册资料及您在使用网络服务时存储在[本小程序]的非公开内容，但下列情况除外：<br>(1)事先获得用户的明确授权<br>(2)根据有关的法律法规要求；<br>(2)按照相关政府主管部门的要求：<br>(3)为维护社会公众的利益；<br>(4)为维护[本小程序]的合法权益.</p>');
/*!40000 ALTER TABLE `privacy_protocol` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reason`
--

DROP TABLE IF EXISTS `reason`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reason` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `type` int NOT NULL COMMENT '1、企业招聘2、零工招聘3、零工求职',
  `information_id` bigint NOT NULL COMMENT '招聘信息id',
  `reason` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '审核失败理由',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1756689212433793027 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='审核失败的理由表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reason`
--

LOCK TABLES `reason` WRITE;
/*!40000 ALTER TABLE `reason` DISABLE KEYS */;
INSERT INTO `reason` VALUES (1,3,1731921368225705986,'企业招聘审核失败'),(2,2,44613515159,'零工招聘审核失败'),(3,3,6,'零工求职审核失败'),(1740635836812132354,3,1,'111'),(1740636041536110594,3,1737817914640052226,'1111'),(1740636095890096129,3,1737818084232540162,'sadas'),(1740636207450193921,2,1740379323991224322,'sadsad'),(1740884300523487234,2,1740598473348210690,'cxv cx'),(1742371308612558850,1,1741059890106953729,'无营业执照'),(1756689212433793026,2,1756688910972387330,'12');
/*!40000 ALTER TABLE `reason` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `refund`
--

DROP TABLE IF EXISTS `refund`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `refund` (
  `id` bigint NOT NULL COMMENT '主键',
  `name` varchar(64) NOT NULL COMMENT '商品名称',
  `thumbnail_url` varchar(255) NOT NULL COMMENT '略缩图url',
  `price` decimal(10,2) NOT NULL COMMENT '商品价格',
  `code` varchar(64) NOT NULL COMMENT '商品码',
  `quantity` int NOT NULL COMMENT '该商品的数量',
  `order_no` bigint NOT NULL COMMENT '订单号',
  `good_id` bigint NOT NULL COMMENT '要退款的商品id',
  `status` int NOT NULL COMMENT '状态：2待退款，3已退款，4拒绝退款',
  `user_id` bigint NOT NULL COMMENT '用户id',
  `put_time` datetime NOT NULL COMMENT '申请时间',
  `reason` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '退款原因',
  `refund_no` bigint NOT NULL COMMENT '退款单号',
  `refund_amount` decimal(10,2) NOT NULL COMMENT '退款金额',
  `is_agree` int NOT NULL DEFAULT '0' COMMENT '是否同意退款 0不同意 1同意',
  `is_apply` int NOT NULL DEFAULT '0' COMMENT '是否向微信申请退款 0否1是',
  `err_reason` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '退款出错原因',
  `reject_reason` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '管理员拒绝理由',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='待退款表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `refund`
--

LOCK TABLES `refund` WRITE;
/*!40000 ALTER TABLE `refund` DISABLE KEYS */;
INSERT INTO `refund` VALUES (1752611135580688386,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,1752611135451557888,1397849739275151007,3,1742169110809092099,'2024-02-11 22:39:33','老子要退款',1756689433363058688,3.99,1,0,NULL,NULL),(1752611135580688387,'橙子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',4.99,'3456789012345',2,1752611135451557888,1397849739275151008,4,1742169110809092099,'2024-02-11 23:05:44','退退退',1756696022799216640,9.98,0,0,NULL,'滚滚滚'),(1756701318340157442,'橙子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',4.99,'3456789012345',2,1752611135451557888,1397849739275151008,4,1742169110809092099,'2024-02-11 23:26:47','123',1756701317990518784,9.98,0,0,NULL,'1321312'),(1758429909524463617,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,1752610960310005760,1397849739275151007,4,1742169110809092099,'2024-02-16 17:55:35','213',1758429909145473024,3.99,0,0,NULL,'sad'),(1758431051826380802,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,1752610960310005760,1397849739275151007,4,1742169110809092099,'2024-02-16 18:00:07','213',1758431051485138944,3.99,0,0,NULL,'213'),(1758433913990098946,'香蕉','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/86300055YAp4tmGGeJ6uMHyQ60dUBGJ3.png',3.99,'2345678901234',1,1752610960310005760,1397849739275151007,3,1742169110809092099,'2024-02-16 18:11:30','商品破损',1758433885618192384,3.99,1,0,NULL,NULL),(1758438452810002434,'橙子','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s382rd.jpg',4.99,'3456789012345',2,1752610960310005760,1397849739275151008,4,1742169110809092099,'2024-02-16 18:29:32','请求退款',1758438452280016896,9.98,0,0,NULL,'拒绝退款'),(1758445344152158209,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,1758445101195464704,1397849739275151010,4,1755843332621242369,'2024-02-16 18:56:55','申请退款',1758445343739482112,8.99,0,0,NULL,'拒绝'),(1758445861217566722,'西瓜','https://villageestation.oss-cn-guangzhou.aliyuncs.com/shop/v2_s2iqis.jpg',8.99,'5678901234567',1,1758445101195464704,1397849739275151010,3,1755843332621242369,'2024-02-16 18:58:58','橘子都烂了',1758445860884582400,8.99,1,0,NULL,NULL);
/*!40000 ALTER TABLE `refund` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `service_protocol`
--

DROP TABLE IF EXISTS `service_protocol`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `service_protocol` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `service` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='服务协议';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service_protocol`
--

LOCK TABLES `service_protocol` WRITE;
/*!40000 ALTER TABLE `service_protocol` DISABLE KEYS */;
INSERT INTO `service_protocol` VALUES (1,'<p>一、协议的范围<br>xxxxxxxxxxxxxxxxxxx<br>二、小程序注册与审核<br>xxxxxxxxxxxxxxxxxxx<br>三、服务及规范<br>xxxxxxxxxxxxxxxxxxx<br>四、法律责任<br>xxxxxxxxxxxxxxxxxxx</p>');
/*!40000 ALTER TABLE `service_protocol` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `shopping_cart`
--

DROP TABLE IF EXISTS `shopping_cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `shopping_cart` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` bigint DEFAULT '0' COMMENT '用户id',
  `goods_id` bigint DEFAULT NULL COMMENT '商品id',
  `number` int NOT NULL DEFAULT '1' COMMENT '数量',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `checked` tinyint unsigned NOT NULL DEFAULT '0' COMMENT '是否选中',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1777888821978849282 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='购物车';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shopping_cart`
--

LOCK TABLES `shopping_cart` WRITE;
/*!40000 ALTER TABLE `shopping_cart` DISABLE KEYS */;
INSERT INTO `shopping_cart` VALUES (1742106048819298305,1742102287673655298,1397849739275151103,1,'2024-01-02 16:50:23',0),(1742106053240094722,1742102287673655298,1397849739275151104,1,'2024-01-02 16:50:25',0),(1742106058847879170,1742102287673655298,1397849739275151106,1,'2024-01-02 16:50:26',0),(1742106075247607809,1742102287673655298,1741366553930178561,1,'2024-01-02 16:50:30',0),(1742106178461040641,1742102287673655298,1397849739275151040,1,'2024-01-02 16:50:54',0),(1742148199305416706,1,1397849213576890114,4,'2024-01-02 19:37:53',0),(1742148307476516866,1,1397849739275151008,5,'2024-01-02 19:38:19',0),(1745816672426430466,1745814552339976194,1397849213576890114,4,'2024-01-12 22:35:05',0),(1745816727799631874,1745814552339976194,1397849739275151007,3,'2024-01-12 22:35:18',0),(1746493067725017090,1746492246438350849,1397849213576890114,8,'2024-01-14 19:22:50',0),(1746493126487216130,1746492246438350849,1397849739275151001,1,'2024-01-14 19:23:04',0),(1747207581696327682,1742169110809092099,1397849739275151001,100,'2024-01-16 18:42:04',0),(1748180910800412674,1742169110809092099,1397849213576890114,61,'2024-01-19 11:09:43',0),(1748573004186537986,1742169110809092099,1397849739275151007,1,'2024-01-20 13:07:46',0),(1748573012529008641,1742169110809092099,1397849739275151008,2,'2024-01-20 13:07:48',0),(1748580596136902658,1742169110809092099,1397849739275151009,1,'2024-01-20 13:37:56',0),(1752607933514813442,1742169110809092098,1397849213576890114,1,'2024-01-31 16:21:08',0),(1753439768109051906,1742169110809092100,1397849739275151001,1,'2024-02-02 23:26:33',0),(1753439787474153474,1742169110809092100,1397849213576890114,1,'2024-02-02 23:26:37',0),(1755317939204956162,1742169110809092099,1397849739275151010,2,'2024-02-08 03:49:44',0),(1755317944317812737,1742169110809092099,1397849739275151011,2,'2024-02-08 03:49:45',0),(1755317964471443457,1742169110809092099,1397849739275151012,1,'2024-02-08 03:49:50',0),(1755971180065492993,1755843332621242369,1397849213576890114,2,'2024-02-09 23:05:28',0),(1758150530266222594,1755843332621242369,1397849739275151010,1,'2024-02-15 23:25:26',0),(1774139804132302850,1755527534073651201,1397849739275151049,1,'2024-03-31 02:21:06',0),(1774639899042897922,1755527534073651201,1397849739275151015,1,'2024-04-01 11:28:18',0),(1777888821978849281,1753439434280202241,1397849739275151010,1,'2024-04-10 10:38:21',0);
/*!40000 ALTER TABLE `shopping_cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_address`
--

DROP TABLE IF EXISTS `user_address`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_address` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '0' COMMENT '用户openid',
  `consignee` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '收货人',
  `phone` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '手机号',
  `province` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '省级名称',
  `city` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '市级名称',
  `district` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '区级名称',
  `detail` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '详细地址',
  `is_default` int DEFAULT '0' COMMENT '默认 0 否 1是',
  `is_deleted` int DEFAULT '0' COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1764736399307694082 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='地址管理';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_address`
--

LOCK TABLES `user_address` WRITE;
/*!40000 ALTER TABLE `user_address` DISABLE KEYS */;
INSERT INTO `user_address` VALUES (1417414926166769666,'1','小李','13512345678','广东省','清远市','清城区','中宿路36号5',0,0),(1417414926166769681,'1','赵六','13512345678','广东省','清远市','清城区','中宿路36号',0,0),(1417414926166769682,'1','张三','13512345678','广东省','清远市','清城区','中宿路36号',1,0),(1742003781495619586,'1741866144495497217','哈哈哈','姐姐好','广东省','深圳市','罗湖区','回家',1,0),(1742004105555935234,'1741866144495497217','估计','不回家','广东省','深圳市','罗湖区','干活',0,0),(1742098057416081409,'1','1','11','广东省','深圳市','罗湖区','1',0,0),(1742102028910264322,'1742101348787093505','12','123123','广东省','深圳市','罗湖区','',0,0),(1742105852149547009,'1','张三','13512345678','广东省','清远市','清城区','中宿路36号',0,0),(1742110459280949250,'1742110156498337793','。','1','广东省','深圳市','罗湖区','。',0,0),(1742159447136870401,'1741679222822281217','哈哈','uh','广东省','深圳市','罗湖区','哈哈',1,0),(1745816635755630593,'1745814552339976194','李飞','15322757680','江西省','南昌市','东湖区','侧室地址',1,0),(1746913078678745089,'1742169110809092099','1','1','广东省','广州市','天河区','1',0,0),(1753440006844641282,'1742169110809092100','李伟强','17353037925','广东省','清远市','清城区','源潭',1,0),(1755513687964033025,'1747557704277139458','1','.1','江西省','南昌市','东湖区','啥',1,0),(1758150682557206529,'1755843332621242369','12','12','广东省','广州市','荔湾区','121231',1,0),(1764736399307694081,'1753439434280202241','123','13512345678','广东省','广州市','天河区','xxx',1,0);
/*!40000 ALTER TABLE `user_address` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键 ',
  `openid` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '微信用户唯一标识',
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '姓名',
  `nick_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '昵称',
  `phone` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '手机号',
  `id_number` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '身份证号',
  `avatar_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '头像的url地址\r\n',
  `village` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '乡村地址',
  `address_default_id` bigint DEFAULT NULL COMMENT '用户默认地址id',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  `password` varchar(64) DEFAULT NULL COMMENT '密码',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1780254769931083779 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='用户信息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'nJWSe73yNN3OXyQWgGGoE9ABQeuA','张三','Jimmy','13991070068','441881199562897558','/avatar/v2_s2nhwf.jpg','英德市 连江口镇 连樟村',139215333020,'2023-11-15 23:02:39',NULL),(3,'03v8jXWU802E7NDNe3QnFYSp9rey','余子异','Michelle','13952453347','441881199554001942','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',192542833728,'2023-11-15 21:56:46',NULL),(4,'NcatFu3nrd0z4lsaguNSgUSoVfE9','钟詩涵','Josephine','13945899840','441881199519895549','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',78995398744,'2023-11-15 00:50:26',NULL),(5,'cwYcPybmkH3P02J52iJmXnoBMwj4','罗岚','Joyce','13970917041','441881199519151980','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',151081657398,'2023-11-15 23:21:13',NULL),(6,'iKIO3bErdTdlaLbdUrbp4Q67vPul','韦震南','Gary','13935522124','441881199533632978','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',66688243933,'2023-11-15 09:07:21',NULL),(7,'fuh4JV3PaN7TJGrupYahrs5prRIF','崔璐','Sylvia','13987855668','441881199524732925','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',200937685026,'2023-11-15 15:32:25',NULL),(8,'Crz4JqGg6Xx3UaYHMXl58HBNE3Jl','秦晓明','Mario','13964251823','441881199562133189','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',75695214608,'2023-11-15 21:22:00',NULL),(9,'dEGgwy0uzLXHMRD0ssMYhQm38cud','袁晓明','Donna','13999445706','441881199510657392','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',21391104304,'2023-11-15 21:19:30',NULL),(10,'lzOVswfp3OGCQFXGugDuOdj72iCe','林致远','Jeffery','13902452340','441881199562562827','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',77644629771,'2023-11-15 01:02:23',NULL),(11,'wb8OCHgE6nlEVABYtmlyB5ZmcWGP','傅子韬','Dale','13991690519','441881199507912446','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',122915753809,'2023-11-15 03:37:09',NULL),(12,'I1reZaosvHSpw1m3jRQBlnHPN1tA','谭睿','Teresa','13981617399','441881199588283611','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',62345914059,'2023-11-15 12:39:44',NULL),(13,'zgQovUnUr2SVFzoZQdTSnDJW0Zcp','陈云熙','Tony','13940011562','441881199508064358','https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/d2mwrzbat6.jpg','英德市 连江口镇 连樟村',59714184442,'2023-11-15 01:11:25',NULL),(1742101348787093505,'oCeXU5fSNeTzNZPqasWbgkAbBORM','666','鹊楠吖','123456789','12345649','https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/3910866pmAnL1g07WSg1p2fgWhP6sMg.jpg','5163',NULL,'2024-01-02 16:31:43',NULL),(1742169110809092097,'oCeXU5bmtPtDzoej8kP_Sdd7iPZ0','1','1','1','1','https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/5627591fSDUq5varRozYEU4K1MGkkm6.jpg','1',NULL,'2024-01-02 21:00:59',NULL),(1742169110809092098,NULL,'管理员','管理员','13642001230',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s3r5zy.jpg','英德市 连江口镇 连樟村',NULL,'2023-12-27 18:47:15','e10adc3949ba59abbe56e057f20f883e'),(1742169110809092099,'oSl6h60GFEcP1_e5R2wrO9YF2Jzk','张三','tes1111t','18318085358',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/avator/572d7da9-d55e-44ea-81b7-ec606af8c4d7.jpg','英德市 连江口镇 连樟村',NULL,'2024-01-01 12:34:20','e10adc3949ba59abbe56e057f20f883e'),(1742169110809092100,NULL,'苏泽伦','团团儿','17353037925',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/85318615Zli1lg9MEpebeGGMWGD2KKM8.jpg','清远市清城区',NULL,'2024-01-02 02:11:27','21420aca55cefa0dfd891c61765b3e08'),(1745260344040808449,NULL,'张三','tes1111t','13912312311',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s2nhwf.jpg','英德市 连江口镇 连樟村',NULL,'2024-01-11 09:44:26','123'),(1745284010699821058,NULL,'ubn','hhb','55',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/29842409Fb6JVBCZAkmi12StiYrDUFgo.jpg','hnbbn',NULL,'2024-01-11 11:18:29','d9a000206b800f828c264e939b949ba6'),(1745814552339976194,'oCeXU5Q3Hr7YiXXkTvgMsVIZkCik','李飞','Paul','15322757680','441621199509154415','https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/53115071ODPdf7oJZIFsJfYOnnbGKZaK.jpg','清远市',NULL,'2024-01-12 22:26:40',NULL),(1745977573610414081,NULL,'张三','test','13413557286',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s2nhwf.jpg','英德市 连江口镇 连樟村',NULL,'2024-01-13 09:14:27',NULL),(1745978854601203714,NULL,'张三','test','13413557672',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/avatar/v2_s2nhwf.jpg','英德市 连江口镇 连樟村',NULL,'2024-01-13 09:19:32',NULL),(1747557704277139458,'oCeXU5dDkzv8893zVqq_I2VW6Rws','abc','t71efbtlrfi','178172',NULL,'/static/avatar/default.jpg','河北区 新开河街道 不知道',NULL,'2024-01-17 17:53:19',NULL),(1753439434280202241,'oCeXU5R4nAsSBVsAKeT9kb2PjqqI','苏苏','苏小团团','13620506684',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/73253484-5721-425c-9743-e1a932fe3bf4.jpg','清城区 东城街道 源潭',NULL,'2024-02-02 23:25:13',NULL),(1755316143212371969,NULL,'ghj','tyu','123',NULL,'/static/avatar/default.jpg','ghj',NULL,'2024-02-08 03:42:35','ea7d201d1cdd240f3798b2dc51d6adcb'),(1755316515486212098,NULL,'rt','qqq','11',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/d8789a69-ebdc-4efc-b269-4547220e774d.jpg','1',NULL,'2024-02-08 03:44:04','c4ca4238a0b923820dcc509a6f75849b'),(1755527534073651201,NULL,'1222222','12121','19075217675',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/453a00bb-fa2d-484b-8500-87fc9445328e.png','1',NULL,'2024-02-08 17:42:35','e10adc3949ba59abbe56e057f20f883e'),(1755591274248826881,NULL,'12','1','21',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/f8475fe7-8e27-4e20-a242-6b3a9fd72aca.jpg','1212',NULL,'2024-02-08 21:55:52','a01610228fe998f515a72dd730294d87'),(1755843332621242369,'oCeXU5ejXozIY5bR26V2W_2553Dw','112','1','11222222',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/02abf0cc-aa5b-46a4-83dc-a579a130abee.jpg','宝坻区 方家庄镇 11',NULL,'2024-02-09 14:37:27',NULL),(1780254769931083778,'oCeXU5XjCTqz2gL4if0ysfVPdqlQ','黄素玲','呆呆','18307624457',NULL,'https://villageestation.oss-cn-guangzhou.aliyuncs.com/comment/d47e06ff-a134-4c6f-82bf-fbacb3049fcb.jpg','连平县 忠信镇 大陂村',NULL,'2024-04-16 23:19:47',NULL);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-29  1:30:01
